{"-O1sx-4qDM0DR5SUligk":{"content":"Hello! If you're seeing this, I've officially created my first blog on my website! I'm going to test a few things here for the markup.\n\n> I'm going to test a few things here for the markup\n\n```js\nconsole.log('hello')\n```","createdOn":1721089917195,"lastEdited":1724783747736,"tag":"life","title":"My First Blog on This Website"},"-O5VUuGJg02q35KrI2lz":{"content":"<em>\\*note: The contents of this website are mine and do not reflect any position of the U.S. government or the Peace Corps.\\*</em>\n\nAbout three months ago, I was coming off the high of my college graduation, holding a computer science degree in one hand and an acceptance letter to a master's program in another. Now, I'm in the middle of rural Paraguay, fresh off a bout of food poisoning and nursing a broken foot.\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczM9mS6BYDigkDigBa4sel9ltoxwAn40wHTHYG-dMMB2ZJLK5r638imux31vZnVHRbG2A7kUPNB9ZIAjgNSQQOKsaxe-yPOPJlnES4l9xMOUgK6_Y92gneaxx34b-1WH1aK-JM0nC1hHTOmPaSoOCdF_sw=w1498-h1998-s-no-gm?authuser=0\" />\n\n  <figcaption class=\"text-center\"><em>Celebrating graduation on two non-broken feet</em></figcaption>\n</p>\n\nA few weeks after graduation, I traded my cap in gown in for the \"hardest job you'll ever love\" as a Peace Corps Volunteer. While some might say my altruism has gotten the best of me, one thing is for certain:  I'm still a computer scientist / software engineer at heart. As such, I've elected to try and document some of my journey in the Peace Corps through this blog that I made from scratch (hence why things sometimes looks like crap, so forgive the design and spelling mistakes). With it, I hope to show my parents (and the world) I'm still alive, stave off occasional hours of bordem, and keep my coding skils from atrophying.\n\nAnyways, back to the broken foot thing. It all started when Grace and I arrived as Peace Corps (PC) Health Volunteers in Paraguay. We arrived in-country around May 29th after a short stint of training in Washington D.C. At the airport in Asuncion, we were immediately greeted by some awesome PC staff and whisked to a nearby hotel. Looking out the fogged-up windows of the PC van, let's just say I could tell we weren't in (Ar)kansas anymore.\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczOUYesIEC3xbCgwqTwzvX5kZ8ud_N9bHJjzXuC4M-9w0eqSgIsZL39YENjB0W43mkTSAQqn6ov0Zcn2tN8Dp5lqhOxTo7YaJ7H1K-OAPoR7TEnP_HKyiXZ0dbCGzXs2RGZQs6_szCY1PHea6TcJrbwP_g=w2664-h1998-s-no-gm?authuser=0\" />\n\n  <figcaption class=\"text-center\"><em>We ain't in Ar(kansas) no more Toto</em></figcaption>\n</p>\n\nWe spent a few days in the hotel \"easing in\" to Paraguayan culture and getting briefed on a variety of PC protocols and expectations. Off hours were filled with card games, goofy photos, chess, or mini adventures outside of the hotel to get a \"lay of the land\". Surprisingly, despite coming from many walks of life and parts of the U.S., all the volunteers hit it off really well!\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczOJ9HkKs1RsZ832rzG85QrFgbSe6VUk0CcU8DRGeoU9wICGgoqcWVsNamo470ApqQ6TRtycjjU5RICJXarFHZHxMYWJ3I665hACgj9dlOuU_MpLClGv-3ffUFAN0-PC8pFdCOknCvoxDOmBSY7luaAGDA=w1498-h1998-s-no-gm?authuser=0\" />\n\n  <figcaption class=\"text-center\"><em>One of said goofy photos</em></figcaption>\n</p>\n\nAfter a few days of getting briefed in the hotel, volunteers were quickly matched with and shipped off to host families. Fortunately, Grace and I hit it off with our host parents almost immediately (not to brag, but probably on account of the insaaaaane magic card trick I showed them when we first met). Over the course of the next month, we spent evenings watching movies (or possum fights), playing othello, making alfajores / chipa, chowing down on mandioca (the starch staple of Paraguay), or laughing as Ciri (our host dad) taught me funny Guarani phrases like <em>chivivi</em>. Life as a volunteer was pretty solid -- that is, until tragedy (or rather, a mango) struck.\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczPJZINTchRA3NsFHHq76iCHlSHFTYU-p5vXESM9nRrwVWyOELo6Ohh_GOwkTHzKffqvoD8pHusmZnut6RYDbma4fYVo2rmV0mAoHQ7JJs_KKZ5LHWlgi1fOsYxuf3QNq0170ouHYmqrMwtPO_zmo3iW_w=w2664-h1998-s-no-gm?authuser=0\" />\n\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczOg3OZXsdrVKubcCxP_S05vJO39EljSfrH7syr6HcsCvNBQ3eX4bppdJz-fTmkE5ahI9l_hQ71Cos3BRug0Xu7XaMWIzipJmeB5aQhRW7Qikatqxk6GW1kPMqZp1BLRQPwKFgXSo9MhAdak8TXccZLj-w=w2664-h1998-s-no-gm?authuser=0\" />\n\n  <figcaption class=\"text-center\"><em>Enjoying life playing othello & tinkering, P.M. (pre-mango)</em></figcaption>\n</p>\n\nCutting to the chase here, I broke my foot halfway through pre-service training while I was playing fútbol with some other PCVs after a long day of training. I don't exactly know if slick grass or an errant mango is to blame, but either way, it's gonna be tough to beat the Wiley Coyote allegations. \\*Note to self: only play fútbol in cleats from now on, and beware of mangos!\\*\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczOKv2e3OKHWqUyo7Tz7nsr7se_ypAC9Ipo4t77SJrmeWb7c_DMmqD-1EuCjPkGPfszWeyHzmG_0dGYN_fAzlZO13yU3qb0N2ludiguy897kms5RV48Kb_G3IVTZ3rjr3u8a8doKI8rdLbSxETi6xmaqJw=w1498-h1998-s-no-gm?authuser=0\" />\n\n  <figcaption class=\"text-center\"><em>\"Bad News\" -- X-Ray Tech</em></figcaption>\n</p>\n\nThe break was bad enough that the PC docs said I needed to get surgery -- it was just a matter of whether I'd receive care back in Arkansas or in Paraguay. If I chose to go home, given PC's 40-day recovery policy, it was unlikely I would be able to return. I'd be lying if I said this wasn't a nailbiting decision, but then I realized I'm living in a country with pro soccer players. Armed with that knowledge, I went ahead and opted to have my surgery in Paraguay. With that decision, just a week after breaking my foot, I was under the knife. Obviously, I survived!\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczM5U-pMKJKz3TWPL4Tyu8VYlgKtOVtFOqhcHOwvR64hYYPqdk4a73NTOTd5NzS6sLACnNhiVa9u40AuzkraokrGgV1IGlD44Iqf68AydTj0F72dUyS7P0ou5RIM1cHkSANR4-16JJLlk1Y6OFL7T-wTNw=w1498-h1998-s-no-gm?authuser=0\" />\n\n  <figcaption class=\"text-center\"><em>Mogging on my broken foot right before surgery</em></figcaption>\n</p>\n\nAlthough breaking a foot has indeed sucked (0/10, wouldn't recommend), recovery has felt like a relative walk in the park (er, hobble I guess). PC staff has been more than accomodating, doing everything in their power to make sure I'm included in activities and can get around Paraguay with a set of crutches. What's more, a broken foot has proved to be the ultimate conversation starter with locals! My favorite response to inquiries as to what happened is simply <em>\"estuve jugando fútbol con Messi\". </em>\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczPF87oVN7EYMgYLAi4d88UWsbJoMzZx2QBel_NjWDFvklR3hv_b_c-dLskJuaHEWxYoXv3U9Llq_EkPKBhCmuXyAtoU3vc-N8bUKObtRS1BN8Dr1NSTOxzxDZXFOfkapSdzJU9Ruy9aPu0dKHnkjZK0eQ=w2664-h1998-s-no-gm?authuser=0\" />\n\n  <figcaption class=\"text-center\"><em>A cultural dance day tailored to a broken foot</em></figcaption>\n</p>\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczNBNQBH-pZYrt57B0o4ZUNgFTbLND5X6Wfkb11N5JSdRsBU3TW9ITDKbe1jFcaScGVBLCJeLvhKL0oSvQT1kPNuo5ZdDQwZu7bInqLRyJY4_-nwKam-YNKWCBXoDWbBFQU0--Rs1lOrLj9XSTB4oTH5bw=w2664-h1998-s-no-gm?authuser=0\" />\n\n  <figcaption class=\"text-center\"><em>Starting service off on the right foot (Grace gave the speech!!!)</em></figcaption>\n</p>\n\nAs I write this, it seems the worst of this broken foot fiasco is behind me. I can't run, but I'm already back to walking (albeit, slowly)! Community integration has also been going great, though I'd be remiss to not mention it would be better if I could play <em>fútbol</em> :(. Luckily, I don't need two feet to play violin -- a fact I've been taking advantage of.\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczMncoM_DzG8Qn8mzmZKJdOlf7Sd4NFZMoMQBt_p8ZL-3MGhJfv88G8jp1Py_CBbapjzTgllk7_3HsbDAJtuzPuYJqrOpdAQNWzJjg1vTh1T0E1fsUmv902osBh458P35TvWN_9P6ww5X0sTi1ldbjyPDQ=w768-h1024-s-no-gm?authuser=0\" />\n\n  <figcaption class=\"text-center\"><em>Playing \"Happy Birthday\" for my new host mom on her bday</em></figcaption>\n</p>\n\nAlas, this chapter of my blog comes to a close. In the future, I'll aim to write a little more frequently, but until then, here's a sporadic list of stuff that didn't make the cut this first time around but I still want to remember in the future: Maxita fleas, week alone in Asuncion, grabbing sugar cane juice with Andres, karaoke and stairs on crutches, piiiiiiines in class with Charlie, teaching Pablo(?) a magic trick, Ciri's <em>fútbol</em> matches, broken steering column, funny farts at the huerta, deferral to GTECH, A/C classes in community, crazy epidural.\n\nAnyways, until next time, <em>jajotopata!</em>","createdOn":1724974603294,"lastEdited":1745412714967,"tag":"🕊️ peace corps","title":"A Jopara of Broken Bones, Magic Tricks, and Mandioca "},"-O7W7SPUuJYJJXa9S2Eh":{"content":"With the advent of ChatGPT, \"AI\" has become the ultimate buzz word. Now, <em>I, Robot, Her,</em> and <em>Terminator</em> seem like more than just lovable sci-fi classics -- they seem like plausible near futures.\n\nA key component of many of the AI models we see today are <em>neural-networks</em>: computer systems modeled (roughly) on the human brain that allow computers to \"learn\". As someone interested in researching AI and its applications, I've always wanted to deep-dive into the specifics of how these networks work.\n\nNow, I know how they work at high level (feed forward step, backpropogation step, need for MLP for XOR problem, activation functions to introduce non-linearity, CNNs for translation independence, e.t.c.) and can even train my own models. However, I've always felt that I don't really know something until I've built it or spent hours playing around with it.\n\nAs such, <em>I've set out to build a neural network from the ground up, using minimal libraries, in C++</em>. I already kinda tried to do this a few months back using 3B1B's video as a guide, but things didn't go that well...let's just say it's not a good idea to build all the functions for your neural network before testing any of them.\n\n<p align=\"center\">\n  <img height=\"400\" width=\"400\" src=\"https://i.imgur.com/4nfVvbg.gif\" />\n\n  <figcaption align=\"center\">Me when my model got worse after training</figcaption>\n</p>\n\nAnyways, I'm gonna go ahead and build this sucker incrementally and write about it so I can 1) force myself to test things as I go along and 2) give myself the opportunity to exercise the \"Feynman technique\". Let's get started.\n\n<h2>I. Linear Regression with 1-D Inputs & Outputs</h2>\n\nI'll be starting off by building a simple linear regression model. A throwback to elementary school, linear models are of the form:\n\n$$\nf(x) = wx + b\n$$\n\n<em>Linear regression</em> involves finding a <em>linear</em> function that accurately maps inputs to outputs (ex: apartment square feet ($x$) and rent ($y$)). In layman's terms, it's the process of finding the \"best fit line\" for some data points in the form ($x$, $y$). In this case, we're tweaking $w$ and $b$ to make $f(x)$ spit out a value close to $y$ for a given $x$. There are more complex forms of linear regression we'll get into later, but we're gonna start with this. To build this linear regression model, I'll:\n\n<ol>\n  <li>Create some data to test the model with (simple linear line)</li>\n  <li>Write a \"loss function\" that allows me to quantify the effectiveness of the current model in fitting said data</li>\n  <li>Write a \"train\" method which gradually adjusts the parameters of the linear function to make it more accurate</li>\n</ol>\n\nCreating the data is pretty straightforward. I know the linear function I'm wanting my model to \"find\" is gonna be $y = 3x + 1$, so I just created ordered pairs that follow this function:\n\n```js\n///*main.cpp*///\n\nint main(int argc, const char * argv[]) {\n    vector<double> x;\n    vector<double> y;\n\n    // Fill x with values from 0 to 5\n    for (int i = 0; i < 5; ++i) {\n        x.push_back(i);\n    }\n\n    // Fill y with a roughly linear relationship to x (y = 3x + 1)\n    for (int i = 0; i < 5; ++i) {\n        y.push_back(3 * x[i] + 1);\n    }\n}\n```\n\n<figcaption align=\"center\">Generating Our Data</figcaption>\n\nNow things get a little more dicey. Priming things for the future, I went ahead and set up a NeuralNet class (yay OOP). In it, I've got the function signature for a constructor (to set the learning rate for our model), our loss function (MSE), and the a train function (to find optimum values of $w$ and $b$).\n\n```js\n///*NeuralNet.h*///\n\nclass NeuralNet {\n    public:\n        NeuralNet(double learningRate);\n        static double MSE(vector<double> &experimental, vector<double> &expected);\n        void train(vector<double> input, vector<double> actualOutput, int epochs);\n\n    private:\n        double learningRate;\n};\n```\n\nWe'll be using <em>mean squared error</em> as our <strong><a href=\"https://en.wikipedia.org/wiki/Loss_function\">loss function</a></strong>, which helps quantify the accuracy of our current model. The formula for this is as follows:\n$$\nMSE =\n\\frac{1}{n}\n\\displaystyle\\sum_{i=1}^n(f(x_i) - y_i)^2\n$$\n<figcaption align=\"center\">Mean Squared Error Function</figcaption>\n\nIn this case, $n$ represents the number of examples in our training data set, and $x_i$ and $y_i$ represent a single input-output pair. Indicated by the word \"error\" in the name here, we want the value of our loss function to be low!\n\nMSE finds the average amount by which my function $f(x)$ is \"off\" at predicting a $y$ value given a particular $x$ value. We square the difference between $f$ and $y$ to 1) allow our average to work as expected with negative numbers and 2) keep our cost function as a differentiable function, which will come in handy later. Here's the function definition for this:\n\n```js\ndouble NeuralNet::MSE(vector<double> &calculated, vector<double> &truthy)\n{\n    double sum = 0;\n    for (size_t i = 0; i < calculated.size(); ++i)\n    {\n        sum += pow(calculated[i] - truthy[i], 2);\n    }\n    return sum / (double)calculated.size();\n}\n```\n\nNow comes the training function. With this, I'm trying to find the $w$ and $b$ values which minimize the MSE cost function above. Rewriting the MSE function with $w$ and $b$ in it (and replacing MSE with $J$ for notational simplicity), we have the following function:\n\n$$\nMSE = J(w, b) =\n\\frac{1}{n}\n\\displaystyle\\sum_{i=1}^n(wx_i+b - y_i)^2\n$$\n\nNow, at this point, things might feel a bit like alphabet soup with all the formulas, so let's try and visualize what's going on here. Given a fixed set of training points ($(x, y)$ pairs), if we graph $J(w, b)$, $w$ and $b$ in a 3-D plane, we get the following <a href=\"https://gist.github.com/JackTNorris/89c02f43f61b52b27e7843fcad061218\">soup-bowl looking graph</a>:\n\n<p align=\"center\">\n  <img height=\"500\" width=\"500\" src=\"https://lh3.googleusercontent.com/pw/AP1GczN9Jg1wyVOVfLbZjkd1JrEXu4-u-jEEX0jv15zoDUVcedMne38A7MUTDZ2ZUv_CAJetEpRPDUVbd3GpYe6W1V5UY0btzKsHQ9AFHl-0P-QQ0g501s0Au5mwpocnzXk1vThSUyZ2Hur504_eLjgWWUjJbw=w640-h480-s-no-gm?authuser=0\" />\n</p>\n\n<figcaption align=\"center\">Graph of Our Loss Function</figcaption>\n\nWith our train function, we want to select a $w$ and a $b$ that minimizes our cost function $J$. We can see where this is graphically (at the bottom of our \"soup bowl\"), but how do we get there programatically? If we've selected a $w$ and $b$, how do we know how to tweak them in order to minimize our cost function? The answer (in this case) is an optimization method called <strong><a href=\"https://www.ibm.com/topics/gradient-descent\">gradient descent</a></strong>.\n\nFor starters, we've got to calculate the partial derivatives of $J$ with respect to $w$ and $b$, $\\frac{\\partial{J}}{\\partial{w}}$ and $\\frac{\\partial{J}}{\\partial{b}}$:\n\n$$\n\\frac{\\partial{J}}{\\partial{w}} = \\frac{2}{n}\\sum_{i=1}^n(wx_i+b - y_i)x_i\n$$\n$$\n\\frac{\\partial{J}}{\\partial{b}} = \\frac{2}{n}\\sum_{i=1}^n(wx_i+b - y_i)\n$$\n\nBy doing this, we've effectively calculated the <em>gradient</em> of the function $J(w,b)$:\n\n$$\n\\nabla{\nJ(w, b) = \\begin{bmatrix}\n\\frac{\\partial{J}}{\\partial{w}} \\ \\\\\n\\frac{\\partial{J}}{\\partial{b}}\n\\end{bmatrix} =\n\\begin{bmatrix}\n\\frac{2}{n}\\sum_{i=1}^n(wx_i+b - y_i)x_i \\ \\\\\n\\frac{2}{n}\\sum_{i=1}^n(wx_i+b - y_i)\n\\end{bmatrix}\n\n}\n$$\n\nIf you're unfamiliar with the idea of a gradient -- don't worry. The main thing to know here is that this gradient tells us the the rate of change of $J$ with respect to its independent variables at a given point. If you plot this gradient as a vector at said point, it points in the direction of steepest ascent, with the magnitude of this vector growing as the ascent grows steeper.\n\nGiven that our gradient vector indicates the direction of <em>steepest</em> ascent, we want to \"nudge\" our weights & biases in the <em>opposite</em> direction of the gradient. Based on this, we have the following formula, in which $\\alpha$ represents our <strong>learning rate</strong>:\n\n$$\nw_{new} = w_{old} - \\alpha\\frac{\\partial{J}}{\\partial{w}}\n$$\n$$\nb_{new} = b_{old} - \\alpha\\frac{\\partial{J}}{\\partial{b}}\n$$\n\nThe \"learning rate\" dictates the rate at which we find the optimal values of $w$ and $b$. I'll commentate on this a bit more in the future, but the thing to know with it for now is that you don't want it to be too big (or else $J$ will never converge to its lowest value, \"ping-ponging\" between solutions that are too high and too low) or too small (or else $J$ will take forever to converge on its lowest value).\n\nWith our train function, we'll iteratively adjust our weight and bias using the formula above. An <strong>epoch</strong>, as mentioned in the function below, represents a single one of these iterations. The code for this train function is listed below:\n\n```js\n/* NeuralNet.cpp */\nvoid NeuralNet::train(vector<double> inputs, vector<double> expectedOutputs, int epochs)\n{\n    srand(time(NULL));\n    double weight = random() % 40;\n    double bias = random() % 40;\n    for(int epoch = 0; epoch < epochs; epoch++)\n    {\n        vector<double> my_calc;\n        double temp_weight_update = 0;\n        double temp_bias_update = 0;\n        for(int input = 0; input < inputs.size(); input++)\n        {\n            double f = weight * inputs[input] + bias;\n            my_calc.push_back(f);\n            temp_weight_update += 2*(f - expectedOutputs[input])*inputs[input];\n            temp_bias_update += 2*(f - expectedOutputs[input]);\n        }\n        weight -= learningRate * temp_weight_update / inputs.size();\n        bias -= learningRate * temp_bias_update / inputs.size();\n        cout << \"New weight: \" << weight << endl;\n        cout << \"New bias: \" << bias << endl;\n        cout << \"Loss: \" << MSE(my_calc, expectedOutputs) << endl << endl;\n    }\n}\n```\n\n<figcaption align=\"center\">Train Function</figcaption>\n\nNow, it's time to test it! We're looking for our loss function to continue to decrease and for our weight and bias converge on 3 and 1 respectively:\n\n```js\nNew weight: 10\nNew bias: 1.5\nLoss: 2825\n\nNew weight: 5.7\nNew bias: 0.05\nLoss: 308.25\n\nNew weight: 4.27\nNew bias: -0.395\nLoss: 34.3825\n.\n.\n.\n\nNew weight: 3.06295\nNew bias: 0.820536\nLoss: 0.011469\n```\n\nLooks to be working (more or less)!\n\n<h2>II. Linear Regression with Multi-dimensional Inputs and Outputs</h2>\n\nNow we can adjust our model to be able to handle multi-dimensional inputs and outputs. Concretely, this might look like mapping square footage ($x_1$), average income of the zipcode ($x_2$), and city population ($x_3$) to the rent ($y_1$) and average monthly utility bill ($y_2$) for an apartment.\n\nGiven we'll be dealing with vectors, we'll go ahead and invoke the help of the <em><a href=\"http://eigen.tuxfamily.org/index.php?title=Main_Page\">Eigen</a></em> library, which contains optimized implementations of vector and matrix objects and operations in C++. Hopefully, this is the only library we'll need to use for a while!\n\nFortunately, even when we move into higher dimensional spaces, our formulas <em>almost</em> stay the same. However, I will confess that they do get a little more convoluted.\n\n<p align=\"center\">\n  <img height=\"400\" width=\"400\" src=\"https://media.tenor.com/8uZKpgaGe9EAAAAM/hold-onto-your-buts-butt.gif\" />\n</p>\n\nGiven that our weight is now a matrix, $\\bold{W}$ (and not a single value), we now have to take the partial derivative with respect to $J$ for every element in $\\bold{W}$. Our bias is now also a vector, $\\overrightarrow{b}$. With these change, we now have this as the definition of our linear function:\n\n$$\nf(\\overrightarrow{x}) = \\bold{W}\\overrightarrow{x} + \\overrightarrow{b}\n$$\n\nOur cost function also changes a little bit -- we're no longer dealing with 1-D outputs, so our cost function has to reflect that:\n\n$$\nMSE =\n\\frac{1}{nm}\n\\displaystyle\n\\sum_{i=1}^n\\sum_{j=1}^m(f_j(x^i) - y^i_j)^2\n$$\nHere, $m$ represents the number of elements in the output vector, and $f_j$ and $y_j$ represent the $j$ components of each respective vector (forgive me if the notation isn't exactly \"formal\" here). If you think I'm going overboard with summation symbols, get ready for one more as I rewrite MSE in terms of $\\bold{W}$ and $\\overrightarrow{b}$:\n$$\nMSE = J(\\bold{W}, \\overrightarrow{b}) =\n\\frac{1}{nm}\n\\displaystyle\n\\sum_{i=1}^n\\sum_{j=1}^m((\\sum_{k=1}^t\\bold{W}^T_{kj}x^i_k) + b_j - y^i_j)^2\n$$\n\nHere, $t$ represents the dimensionality of the input vector ($\\overrightarrow{x}$), and $x_k$ represents a component of $\\overrightarrow{x}$. $\\bold{W}$ has to be transposed in order to allow multiplication between it and the input vector $\\overrightarrow{x}$.\n\nNow, just like before, we need the partial derivative of $J$ with respect to each element in $\\bold{W}$ and each element in $\\overrightarrow{b}$. Things get a little wonky because of the transpose, but just know that although we're calculating the derivative with respect to the transpose for now, we can always \"transpose the transpose\" and get our original $\\bold{W}$ back.:\n\n$$\n\\frac{\\partial{J}}{\\partial{\\bold{W^T_{aj}}}} =\n\\frac{2}{nm}\n\\sum_{i=1}^n((\\sum_{k=1}^t\\bold{W}^T_{kj}x^i_k) + b_j - yx^i_j)x_a\n$$\n\n$$\n\\frac{\\partial{J}}{\\partial{b_j}} =\n\\frac{2}{nm}\n\\sum_{i=1}^n((\\sum_{k=1}^t\\bold{W}^T_{kj}xx^i_k) + b_j - yx^i_j)\n$$\n\nThese partial derivatives aren't quite as trivial as the last two, so feel free to bring out the paper and pencil if you're following along. Sadly, given that we've moved into multi-dimensional space, visualizing what is going on here is a little tough, so I can only leave you with the source code for our new MSE function and our new train function.\n\n```js\n//* NeuralNet.cpp *//\n\ndouble NeuralNet::MSE_MULTIDIMENSIONAL(vector<Eigen::VectorXd> &experimental, vector<Eigen::VectorXd> &expected)\n{\n    double sum = 0;\n    for(int i = 0; i < experimental.size(); i++)\n    {  \n        for(int j = 0; j < experimental[i].size(); j++)\n        {\n            // fix this\n            sum += (experimental[i](j) - expected[i](j)) * (experimental[i](j) - expected[i](j)) ;\n        }\n    }\n    return sum / (double)experimental.size();\n    \n}\n\nvoid NeuralNet::eigenTrain(vector<Eigen::VectorXd> &inputs, vector<Eigen::VectorXd> &expected_outputs, int epochs) {\n    if (inputs.size() != expected_outputs.size())\n    {\n        throw runtime_error(\"must have same number of inputs as outputs\");\n    }\n    if (inputs.size() == 0 || expected_outputs.size() == 0)\n    {\n        throw runtime_error(\"must use non-empty inputs and outputs\");\n    }\n    int input_dim = inputs[0].size();\n    int output_dim = expected_outputs[0].size();\n    Eigen::MatrixXd weights = Eigen::MatrixXd::Random(input_dim, output_dim);\n    Eigen::VectorXd biases = Eigen::VectorXd::Random(output_dim);\n    for(int epoch = 0; epoch < epochs; epoch++)\n    {\n        Eigen::MatrixXd temp_weight_updates = Eigen::MatrixXd::Zero(input_dim, output_dim);\n        Eigen::VectorXd temp_bias_updates = Eigen::VectorXd::Zero(output_dim);\n\n        vector<Eigen::VectorXd> error_helper;\n        for(int input = 0; input < inputs.size(); input++)\n        {\n            Eigen::VectorXd network_output = weights.transpose() * inputs[input] + biases;\n            error_helper.push_back(network_output);\n            // part of MSE:\n            for(int j = 0; j < network_output.size(); j++)\n            {\n                for(int k = 0; k < weights.rows(); k++)\n                {\n                    temp_weight_updates(k, j) += 2 * (network_output(j) - expected_outputs[input](j)) * inputs[input](k);\n                }\n                temp_bias_updates(j) += 2 * (network_output(j) - expected_outputs[input](j));\n            }\n        }\n\n        //update step\n        weights -= learningRate * temp_weight_updates / (inputs.size() * output_dim);\n        biases -= learningRate * temp_bias_updates / (inputs.size() * output_dim);\n        cout << \"New weight: \" << endl << weights << endl;\n        cout << \"New bias: \" << endl << biases << endl;\n        cout << \"Loss: \" << MSE_MULTIDIMENSIONAL(error_helper, expected_outputs) << endl << endl;\n    }\n}\n```\n\n<figcaption align=\"center\">Updated Multi-dimensional MSE and Train Function</figcaption>\n\nWe'll need some new multi-dimensional test data to go along with our new multi-dimensional linear regression model. Take note of what our expected weight matrix and bias are here:\n\n```js\n/* main.cpp */\n\nint main(int argc, const char * argv[]) {\n\n    // Initialize variables as 2D vectors with 100 rows and 1 column\n    vector<Eigen::VectorXd> x;\n    vector<Eigen::VectorXd> y;\n\n    // Fill x with values from 0 to 5\n    for (int i = 0; i < 50; ++i) {\n        Eigen::VectorXd g = Eigen::VectorXd::Random(3);\n        x.push_back(g);\n    }\n\n    Eigen::MatrixXd w_sol(3, 2);\n    w_sol << 1, 2,\n             3, 4,\n             5, 6;\n    \n    Eigen::VectorXd b_sol(2);\n    b_sol << 4, 6;\n\n    // Fill y with a linear functions\n    for (int i = 0; i < 50; i++) {\n        y.push_back(w_sol.transpose() * x[i] + b_sol);\n    }\n\n    NeuralNet nn(stof(argv[2])); // learning rate\n    //nn.addLayer(1, nn.none);\n    nn.eigenTrain(x, y, stoi(argv[1])); // epochs\n    \n    return 0;\n}\n```\n\nLast but not least, least go ahead and test things with a learning rate of 0.005 and 10000 epochs:\n\n```js\n...\nNew weight: \n0.999986  1.99998\n 2.99999  3.99998\n       5        6\nNew bias: \n4\n6\nLoss: 2.66554e-10\n```\n\n<em>\\*chef's kiss\\*</em>\n\nSweet! It works. Now we've got a machine learning model which can find the optimum linear function between a set of (possibly) independent and (possibly) dependent variables. I know it ain't much, but we'll expand this in the future, ideally having a model which can accurately classify items in the MNIST dataset when we're fully done. For now, thanks for reading, and stay tuned for logistic regression!\n\n<p align=\"center\">\n  <img height=\"400\" width=\"400\" src=\"https://media.tenor.com/SuADVxKkQ-AAAAAM/frankenstein-its-alive.gif\" />\n</p>","createdOn":1727132719303,"lastEdited":1755314548991,"tag":"💻 computer science","title":"Building a \"Neural Network\" from Scratch: Simple Linear Regression"},"-O9UwhBY1xxjixv_4N9B":{"content":"<em>\\*note: The content of this website is mine\nalone and does not reflect the views of the U.S. Government, the Peace Corps, or\nthe Paraguayan Government.\\*</em>\n\nGrace and I have been in site for a little over two month now, and we just had our site presentations! The school district superintendents came in clutch and let us use their projector, and the screen that a professor at the colegio set up for us looked fantastic. The turnout was great, and I'm pretty sure everyone liked the cake we served -- it had <em>dulce de leche</em>, so what's not to like?\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" alt=\"electronics project\" src=\"https://lh3.googleusercontent.com/pw/AP1GczM43n_PyuMzuq3AjMfKSr3vv855OQ5o3UUupwog7MPPNHvYxV7LgmCDxKgRbpvCM-2FaHTHj6DfSzndVkOcPdof8ZjcShPByrCv_-F0m22RecK033Z1O9M05DdZfttmweSlD4-do90kiPBq3sw3txyj2w=w2660-h1995-s-no-gm?authuser=0\" />\n\n  <figcaption class=\"text-center\"><em>Our site presentation</em></figcaption>\n</p>\n\nWith our site presentation out of the way and a few months of charlas & integration under our belts, Grace and I are more than ready to hit the ground running with some projects. We've already lined up <em>charlas</em> for breast cancer awareness, reserved a classroom for our weekly English class (we just had our first class!), and coordinated dates/times with the <em>directora</em> of our <em>colegio</em> to conduct some clubs!\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" alt=\"electronics project\" src=\"https://lh3.googleusercontent.com/pw/AP1GczOFQQFZ1kcf1XgJKSPqrzA2bVdMnKoV_Tz7YziY5Y35-J2RdUx_94EVGEDJjxXeUar1pcxyaTIPjVFv1xAEeveMW01_l8jcPJlD5ZDNs9vdOLzqX2dWiZ6APSizZxUHVEZU7NGeD-V1U13aeLnyP2koSA=w1600-h900-s-no-gm?authuser=0\" />\n\n  <figcaption class=\"text-center\"><em>Waiting for students...still?</em></figcaption>\n</p>\n\nBacktracking a little bit here, things have been pretty great in Grace's and my community, especially since my foot is (almost) healed. Now, I'm actually able to play sports, even if that just means hobbling around as the goalie in fútbol or jumping an inch off the ground during volleyball. Things haven't been all play and no work though -- Grace and I have also been able to help facilitate a couple <em>charlas</em> with a psychologist and the health agents in our community.\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" alt=\"electronics project\" src=\"https://lh3.googleusercontent.com/pw/AP1GczOanpgZSVEKlv3Hd2wyFeL8TCGZWDwN0IsQ8W97-U9WKrFY7c-5d3_lG7zaP-XX1u2m2FvkJ5StIJXJX3SUh7dbN218KIupVAfoqvQB8dTnfuRcmQyKl7uumy7reWLPfU_CoaUj7dkrPApJidYf34Hx0Q=w960-h720-s-no-gm?authuser=0\" />\n\n  <figcaption class=\"text-center\"><em>Me fumbling through our first</em> charla <em>in Spanish</em></figcaption>\n</p>\n\nPractically everyone we've come into contact with has been super guapo, from the directoras of colegios/escuelas to attendants of nearby shops. Grace and I got bikes a few weeks back, so it has been awesome to ride around and visit places and people we haven't seen before. It's also nice to have a quicker route to the houses that sell ice cream and empanadas 😋.\n\nOur host family has been especially great! We've been to a baptism, a liqueur festival, a family reunion, and a few birthday parties already, so we definitely feel like we're \"part of the family\"! Our host sister is a lawyer and our host brother is a bacteriologist, so dinner conversations are always pretty interesting (at least as interesting as they can get with my weak Spanish vocabulary). Grace and I have also had a blast playing cards, chess, Jenga, and Othello with our host niece.\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" alt=\"electronics project\" src=\"https://lh3.googleusercontent.com/pw/AP1GczMZega5FtG1COOUEGQ0oY-aqd21iKjxUHF1Awzy3gA-Y7eUw55D8OY2cn0o3EJCchr3tM2TPKSQTBl4URd0tql1fetQ9Xp8Agzc_C2ZXRNMMyTPGvjq51rJY_JssWOcHqBuNiLfoeHObzY1NW8dhwbIQA=w868-h799-s-no-gm?authuser=0\" />\n\n  <figcaption class=\"text-center\"><em>Our host bro's birthday gift!</em></figcaption>\n</p>\n\nCuisine here has definitely been a bit more \"adventurous\" then what I'm used to in the U.S though. Liver and tripe have been on the menu a few times, and on one occasion, we had an <em>asado</em> with <em>cabeza de chancho</em> (pig head). Most of the chancho was pretty delicious, but I think I'll pass on the brain next time. Grace says I'm just being \"picky\", but I don't know -- I think I just prefer flavors that are a little less... intelligent 🧠. I'm still the guy to \"try anything once\", but after this experience, vegetarianism is looking quite enticing!\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" alt=\"our first brush with mondongo\" src=\"https://lh3.googleusercontent.com/pw/AP1GczNNqEkHnKKo8c_T5sSaDWAHa9w1gqprFx2OtJZiFJZW_X3xa_mtB9ctbbHQUMfDTUxQqOB_tCyPNAEJzgul2CAxfRF3wFHac9CmOXMkn2yMXxuruKbgbJe6OrO1gCjpXMPGyzvzIqRrQgQX6wrcMaB4mg=w2152-h1995-s-no-gm?authuser=0\" />\n</p>\n\n<figcaption class=\"text-center\"><em>Our first brush with </em>  mondongo <em>(cow stomach)</em></figcaption>\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" alt=\"cabeza de chancho\" src=\"https://lh3.googleusercontent.com/pw/AP1GczNQlhntPQO4mkOdXtP7TwLCdf8zkLecE6xYByYAvcfjQsFq-SVp0xJUP3LQQ4YQEngvxcDM9m5mZprYNwnmEfHtHPSKO8JSPABb58FJzZtjfHE6aVS50iFS7h6O4hYB_a9TUqFIUsenwaSB4xx9-hewZw=w2926-h1995-s-no-gm?authuser=0\" />\n\n  <figcaption class=\"text-center\"><em>Mindblowing dinner</em></figcaption>\n</p>\n\nIn other news, Grace and I finally found a house to rent! There were a few hoops we had to jump through to get things finalized for it, but it looks like we'll have our own spot for the duration of our service. A huge plus is the plants we have behind the house -- we've got a mango tree, an avocado tree, and lime tree! Looks like we're gonna have a pretty awesome Christmas when these bad boys ripen.\n\nWe just moved in, which isn't saying much considering 1) we don't own that much stuff and 2) we only moved two doors down from our host family. Regardless, Grace and I are excited to be in our own space to make non-instant coffee and have more control over our schedules. Grace is going to have to have a stricter routine now that she's a pro soccer player.\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczPfMPCgiI2wswgs-T9cpRH7zqq7apY3ZLy-ZFXK4up1MTGLjnBeV1j7hdhZTrFIlM9t5OIXnqJZqShDof8jpPcqh4tes-MV3zzsNnDXScSqvkAh_gSj2XcfVs_9r40EC7866ug7zLTFVleIJFD7aLS_Vw=w1141-h1045-s-no-gm?authuser=0\" />\n\n  <figcaption class=\"text-center\"><em>Shooting my shot with a pro</em> futbolista</figcaption>\n</p>\n\nThat's all for now. Signing off, here are some bonus photos and a sporadic list of things I don't have time to mention but still want to put in here: mucho aire, <em>penales</em> with C., eating roadkill, empanadas with Zulma, clutch disks in Yegros, Gavin visit & \"corgified\" dogs, building tin roofs with host dad, bike seat butt, teaching Ever chess, Grace's soccer game, teaching go-fish and AI to A/C class, <em>tatu</em> confusion.\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczPmxL6vKrE759r-WHeZDHvr7vgc2lHYijcU_83jwdqPFsMQwnJzLQXcj5j1onTSfXaKZ-XXQPU-x1lMRq0mPPhuf41hEwakmMh6bxkY6wC3Nfbp7QBK1EFJmq8Ks2N2RJgc1f_FpxdKZlQBfF-67I5O5Q=w2660-h1995-s-no-gm?authuser=0\" />\n\n  <figcaption class=\"text-center\"><em>Enlisted help for a broken bike</em></figcaption>\n</p>\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" alt=\"electronics project\" src=\"https://lh3.googleusercontent.com/pw/AP1GczP_6qmv_VQkHwL4OpHfCi0qbOUbpaZa_C1rl5ZVboy0YFnE8Jswj9FaYr0icIgBkM0fLVxKjj_UjKCtDIWLjzSjjHLL-mhdF2GawIxqeuM-RxSihlDLaurRMp9JKL1aNJN0G4e_Mb0cE8Ob2k4ONUA66A=w2660-h1995-s-no-gm?authuser=0\" />\n\n  <figcaption class=\"text-center\"><em>ESP32 Wi-Fi message fun in off-hours</em></figcaption>\n</p>","createdOn":1729260343920,"lastEdited":1738282595107,"tag":"🕊️ peace corps","title":"Cabeza de Chancho!?!"},"-ODOVn6wggD4S5ID53b-":{"content":"*note: The content of this website is mine alone and does not reflect the views of the U.S. Government, the Peace Corps, or the Paraguayan Government.*\n\nIt's been about 6 months since Grace and I touched down in Paraguy, and summer is unmistakably in full swing (I'm literally sweating as I write this). While I've still got a lot to learn as far as Spanish, Guaraní, and Paraguayan culture go, there's one thing I've learned for sure: bugs south of the equator ain't no joke! I found out the hard way that we've got some big 'ol cockroaches living in our ceiling (one of which \"dropped in\" on my head a few weeks back), and it's clear that the spiders down here definitely eat their wheaties.\n\n<p align=\"center\">\n  <img height=\"200\" width=\"200\" src=\"https://lh3.googleusercontent.com/pw/AP1GczM6vOnKRPKoWTl71B-Io35StxZzFYhL6omJUCLlQgPLy_hovkE9fsk7ulNAweiXPEIc0fuqHFYCdByxu9vsZiJhzur4CEhFTWyMwrNW2PgO7VzSKQaIjHtLmKdTMd1T0oLuhvS4yRNK0abXQsR7p6gQmQ=w1549-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption class=\"text-center\">Spider behind the bed that wanted to tuck us in -- the size of my hand!</figcaption>\n</p>\n\nFilling in some gaps a bit since my last post, Grace and I have been living in our house for around 2ish months now, and we couldn't be happier with it. We have running water, a slow internet connection, and A/C, so we definitely fall on the \"Posh Corps\" side of the site spectrum (bless the souls of the volunteers that grapple with \"compost toilets\" 🙏). Afternoons are long and hot, but a cold <em>guampa</em> of <em>tereré</em> with a friend makes time fly by.\n\nAlthough we don't live with our host family anymore, we still see them pretty often. Whether we're passing by on the way to our USF, buying groceries, or sharing a Sunday <em>asado</em>, we've had no shortage of opportunities to interact with them, and it's always a treat. Our host brother-in-law is attempting to learn English, and he often has questions that make me wonder what the creators of English were thinking.\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://media.tenor.com/9yLL2NzIrrwAAAAM/cra-cra-crazy.gif\" />\n\n  <figcaption class=\"text-center\">Explaining the many significances of \"beat\"/\"beet\" to our host brother-in-law</figcaption>\n</p>\n\nAbout a month after moving in, we had another volunteer training. This time though, it was with our counterparts! We had some fun, shared some ideas, and crafted plans for the upcoming summer. All said and done, it was a blast cooking s'mores and playing soccer with our counterparts, and as an added bonus, we left with a plan for a summer camp in our community.\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczOvR8R2UqiCjLa3en7vI1XvTygFv6xirnEaXwNoSpvXmYoHkuYga1aZU1p9CJSxbjj0K733zdR9vebfOAx8EAan1vbocYT1AM3HuK1o_ZuBCUSn9xA-Um2Dh8pZbgRUmZ16qq-ESbQSbNDWQwCKVA8jcw=w2814-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption class=\"text-center\">\"You get a certificate, you get a certificate!\"</figcaption>\n</p>\n\nIn other news, Grace and I now have a little guardian to help combat the crazy bugs down here -- we decided to get a cat! She's the color of pepper, so we decided to name here <em>Paminta</em>, which means \"pepper\" in Tagalog. She loves attacking our feet and peeing in our bathroom (ironically right next to the toilet), so she has been a bit of a handful. We love her nonetheless! To keep an eye on her when we leave the house, I went ahead and made a super rudimentary \"kitty cam\" with some spare stuff laying around the house -- security cameras are waaaaaaay too pricey down here.\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczMQHsqnqLLO8lardc35DxUywhy1U8FBaYa6D7XqOuySfVG6mgkRkmlPzSdoi2mTiLCXUsFm9w2ihMF6jkfO6dNaDtCDNy2PP0cjhPgT_x0-bZw0MHiRqBUPs7MZMH6pkHYtyLgBmZIuMSSqvZT6NXO8jg=w1788-h1590-s-no-gm?authuser=0\" />\n\n  <figcaption class=\"text-center\">T.G.F.W (thank god for WebRTC)</figcaption>\n</p>\n\nWith the school year over as of about a week ago, Grace and I have found ourselves with a bit more free-time than usual. We're relishing in it though -- after the new year, our hands will be pretty full with a summer camp, advanced English classes, zumba classes, a young engineers club, and (hopefully) community-organized movie nights. For now though, when we're not lending a hand prepping charlas or reports in our USF, we escape the heat and lean into our hobbies: Grace has her crochet, books, and kitty time, and I have my Advent of Code, side projects, and occasional ping pong and chess matches with a local (we bought ping pong paddles and a football in Asunción a few weeks back, both have been a hit).\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczOvOpxsd56kTU4EaduXoSdTrLPpdn_JauJu9PcFPyLzdmQRyUc_a0B-4yRO_jCuuH5n7ZAIInOIiGyrcjiivrVPwyAmFpr95URn3cDkSVdIuzVgXu_Rb_kwEdWevLebCn6YOaUdllMPIqPx6N_r3_ypeQ=w2752-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption class=\"text-center\"><em>Hake Mate</em></figcaption>\n</p>\n\nI've also recently started Guaraní classes with a local profesor. To be honest, I'm struggling a little bit -- I was pretty strong in Spanish class back in the states (ya know, when the class was English \\<===> Spanish), but I'm quickly realizing it's pretty tough to learn a language through another language you're not entirely proficient in.\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://media.tenor.com/zjtEuXxTn-oAAAAM/rdj-robert-downey-jr.gif\" />\n\n  <figcaption class=\"text-center\">How it feels to try to learn Guaraní... in Spanish</figcaption>\n</p>\n\nBringing this blog to a close (and before I rattle off a sporadic list of things I want to remember), I'd be remiss if I didn't mention I got a haircut! Obviously, that's not all that interesting on its own, but the cool thing is that someone in the community offered to come to my house and cut my hair for free! Either my previous haircut was that bad, or my barber is just that welcoming of a guy -- I choose to believe the latter 😉. Now, without further ado, here's said list and some photos: finessing some computers, FOP grant applications, teaching chess to F & T, ping pong with A y E, jumping spider, other PC couple, Wicked weekend, fused bike seat, almost bowling, and fixing a printer.\n\n<p align=\"center\">\n  <img height=\"200\" width=\"200\" src=\"https://lh3.googleusercontent.com/pw/AP1GczN239d_KkjXFIMXFsRaacbhuNk9pzsCaaMrCL1mK9rJWCDYEy_Yrzp91te1C8WkLSaIwQNcwrIbd81e8igPDqsqWUhhxGQYHcm1JKhfico0D5WmRboFrY_kBLkVKaCtqVm-G4j0PNnZyTOhh0jCfXzRtQ=w1549-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption class=\"text-center\">A hairy situation</figcaption>\n</p>\n\n<p align=\"center\">\n  <img height=\"200\" width=\"200\" src=\"https://lh3.googleusercontent.com/pw/AP1GczOvQ1UEUHz9HNEJls8ULGcmjKj5s-3-35urFU3_Pm-1cRzY0lwAAmqM-GQggMs-amgrxogJvGV7uZHP6a5c4c6uRKWqeuvn6yTPhZIWIHZ_a2H-xmhATFVHJq0VQz80B0pbgUnMaU-ExQSHOIt4DItJgg=w1549-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption class=\"text-center\">A less hairy situation</figcaption>\n</p>\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczMtfQYwIxm-y8kU473PgbEv85f8rlJ3cXO92WFtH_awj0QxxWuQHkeM9_xPCkrljmudXulwCbPUbEjVPCERh0CZBMYHL3p4c-mTL-T_5nnR6dGMZAAxLCMgzb0xhrJGb4bizj_PLeUYnDiiwfz10aTzog=w2752-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption class=\"text-center\">Stockings above a Paraguayan fireplace</figcaption>\n</p>","createdOn":1733447331960,"lastEdited":1738282690813,"tag":"🕊️ peace corps","title":"Bugs, Beets, Battlestarga– I mean, Balls"},"-OFOEVR_mCpfXg8H5gro":{"content":"<em>note: The content of this website is mine alone and does not reflect the views of the U.S. Government, the Peace Corps, or the Paraguayan Government.</em>\n\nIt's almost New Year's Eve, and it's clear that the Paraguayan climate has no plans to lay off the gas when it comes to heat. I visited a friend that's been here for about a year and a half (more on that in a sec), and he imparted the wisdom that it reaches over 117°F here in January, even in the <em>campo</em> ... so 6d 76 62 79 20 73 6c 61 61 6c 79 20 6c 65 77 73 6c 61 70 63 6c 21 I guess.\n\n<p align=\"center\">\n  <img height=\"250\" width=\"250\" src=\"https://media.tenor.com/RBrUuN4z0ewAAAAM/guess-ill-die.gif\" />\n\n  <figcaption class=\"text-center\"><em>Knowing it's hot, but being too lazy to convert °C to °F to know how hot</em></figcaption>\n</p>\n\nIt's been a bit of a slow roll through December since my last blog, but things haven't been totally uneventful. For one, I helped fix a local friend's computer. It was a really old Toshiba Satellite with a hard drive that made a few odd sounds on boot, then proceeded to shut down almost immediately. The computer technician my friend took it to said it would be impossible to fix, so giving it to me was a bit of a hail Mary before it got sent to the dump. I initially figured something funky was up with the arm of the hard drive or the boot record, but before I could investigate much more, the problem resolved itself after a hard reset (holding the power button for 15 seconds, removing the battery, turning back on, etc). I guess turning things off and back on again really <em>is</em> the answer sometimes!\n\n<p align=\"center\">\n  <img height=\"250\" width=\"250\" src=\"https://media.tenor.com/TkfHDR6TQkEAAAAM/zoolander-zoolander-movie.gif\" />\n\n  <figcaption class=\"text-center\"><em>Plan B if the hard reset didn't work (I studied CS not CE)</em></figcaption>\n</p>\n\nMoving along, with the slowness in-site that accompanies the holidays, I decided to visit a buddy's \"nearby\" site to learn a bit about the projects he's been doing in his community for the past year and a half. \"Nearby\" is in quotes because, as the crow flies, his site is pretty close to mine. However, with bus hecticness down here, I ended up having to go all the way to Asunción, turning a 5ish hour journey to a 24ish hour one. All good -- I got to eat some Mexican food and visit a hobby electronics store while I was in town, so it was totally worth it.\n\n<p align=\"center\">\n  <img height=\"250\" width=\"250\" src=\"https://lh3.googleusercontent.com/pw/AP1GczOELyPSX5mohsKYTJnWUVVrxFVNWl-FRc6qrQAFaisqUoKmVUk3NCnbZfUP_bMWI9KvxQ8bccoIpl70U8RB7wc1VcB-c87GoAgE_Q9bx2GBQRq5d5hi3t4SQ_9P-hrcp4bFnuCdmJdgHMrpSX3tYX-vcQ=w784-h1188-s-no-gm?authuser=0\" />\n\n  <figcaption class=\"text-center\"><em>Awesome food, awesomer shirt?</em></figcaption>\n</p>\n\nMy buddy is an engineer by training and one of the hardest working folks I've ever met. Impressively, he built his own gym from scratch at site! Though I didn't stay at his site long, we spent our time chatting with locals, looking at stars (no light pollution does wonders), grilling up burgers, and making homemade weight plates out of concrete and bicycle rims (he was expanding his gym and I wanted to see how he made his weights). Perhaps the coolest thing of all is that the weight plates were designed jointly by him and one of the community members. Role model: found!\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczPwaKtjpCTUpnTjZdK7J2g_Es-gk9IooxODIMbUALZ6kKfQ7Yi0s4_E5Dp1JtO5uNix2Sg3N2LjpKMfZO9K4fb3_VJkfZAhzutbvFAgeeG8_knICjujtTvuSm7eMocmU40RaM8BVSRcLFjOnbWOx4pM4Q=w2752-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption class=\"text-center\"><em>Making a tasty burger (sans \"tasty beverage\")</em></figcaption>\n</p>\n\n<p align=\"center\">\n  <img height=\"250\" width=\"250\" src=\"https://lh3.googleusercontent.com/pw/AP1GczNn4zmi3U-xgqUPTj7QiwzODe2Jk7b08jQG38sx224_zKKIzgESQmF960G59jRVtRRDwEFQlnk21Iq7tbFryWj2ah_fv03AAOKYkfcRVK2v3JEyJrEOex91OIWzaeVNm1U8qbTYwt3Ld8ge9LmWyQveEA=w1549-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption class=\"text-center\"><em>Hard work, 'nuff said</em></figcaption>\n</p>\n\nFast-forwarding a bit, Christmas here was a quiet yet enjoyable time. On Christmas Eve, Grace and I went over to our host family's house to enjoy a small asado as the clock struck midnight. I brought my violin to play a little Christmas music (of course!), and the family was thrilled enough with my performance that they invited us along to another house to continue playing. <em>Feliz Navidad</em> was obviously a crowd favorite, but I've been more partial to <em>White Christmas</em> as of late -- nothing like the heat to make you dream of one.\n\n<p align=\"center\">\n  <img height=\"250\" width=\"250\" src=\"https://lh3.googleusercontent.com/pw/AP1GczPw9EGrrzaqK8MnS_xXGTxAOEkKVIUW8wboKCvlUFPDuy8gCrng6wzmLXWtqrSI9U_VtMVWbR4JxaWCwl_35A3RJXzAf5bmxay7aT0msnpK73BFCFwd2TfGnCZ3q2Uq9aIDL1vXrrcG9ZQ0epL0FTvfMA=w1178-h1278-s-no-gm?authuser=0\" />\n\n  <figcaption class=\"text-center\"><em>Stringing together notes, realizing I should learn some Paraguayan songs</em></figcaption>\n</p>\n\nThe tide of a new year inevitably brings in a few waves of reflection (or existentialism, have your pick). It's hard to believe Grace and I left the U.S. 6 months ago. Although it feels like the time has flown by, the missed holidays, life milestones of friend and family, and birthdays are stacking up. However, I'm glad to be where I am. Nestled between the cold sips in <em>terere</em> circles, ad-hoc ping-pong matches with locals, and hot afternoons people-watching at our health post, I've found a little bit of perspective on life, as well as a rekindled love for a few hobbies (I found time to <em>actually</em> complete the advent of code this year! 💪)\n\n<p align=\"center\">\n  <img height=\"250\" width=\"250\" src=\"https://lh3.googleusercontent.com/pw/AP1GczNceng0-xMdLPbIgbcjNZkORYJRF4kVehq8W6V694EKJVryD7PQfdIduBuVna-oIJ5Af0sqDkiSvj0t2B6OOfP_FA7qYIcPSrbFmOUvtPO7VPaHR2Det487-alrqwesk3Bv6YFeup7V-EAEpIO8qNiTHA=w1152-h1132-s-no-gm?authuser=0\" />\n\n  <figcaption class=\"text-center\"><em>Booyah</em></figcaption>\n</p>\n\nCutting the corniness now, as always, here's that sporadic list of things I want to remember and a bonus picture: night shooting pool with GGTL, G leaving, mask lady on <em>caca</em> express, Schrodinger's (locked in) cat, finding Bernie, Jimmy the electronics man, jumping jack E, back with Jif, birthday call.\n\n<p align=\"center\">\n  <img height=\"250\" width=\"250\" src=\"https://lh3.googleusercontent.com/pw/AP1GczP4yOQuQgwGq9fvxJhsR_Bgyml_aZra9gwqxyBuiVZJPS8uWqsTEUUNZYNPGB9vlGx86OZJ2lXe8i6W8yFRZMwN4r12FvntcM1wKVTy11I_CGSTOup_qOrxBHepbkay1d04hbBwStPt2RgksduH_bxStg=w1200-h1600-s-no-gm?authuser=0\" />\n\n  <figcaption class=\"text-center\"><em>Santa?</em></figcaption>\n</p>\n\nFor those wondering what that weird string up top is, I ask: <em>Et tu, Brute?</em>. For those wondering what the rest of the info below means, you'll have to work a little harder to find out (hint: it was my birthday recently).\n\nFC CF 1D BB 80 9D DD 4B EC C2 9D 88 14 BF 9B CE D5 71 F3 D7 FB 86 15 B7 84 D5 CF 1D BB 8E D3 82 1A B0 D7 D1 8A 18 AA 82 CF 8A 08 D4 DA 9D A9 12 B0 9E CE 87 5B BD 85 C4 9F 0F B1 D7 DF 80 14 B5 FD 90 CF 3D B7 99 D4 9C 13 FE 93 D8 8A 0B FE 9B D8 8E 09 B0 9E D3 88 5B BC 98 D2 84 71 F3 D7 FB 86 15 B7 84 D5 CF 1A AA D7 D1 8A 1A AD 83 9D DC 5B 93 BE E9 CF 14 AE 92 D3 CF 18 B1 82 CF 9C 1E A9 96 CF 8A 5B B3 96 C9 87 5B BD 98 C8 9D 08 BB 84 B7 C2 5B 99 92 C9 CF 12 B0 83 D2 CF 1A B0 98 C9 87 1E AC D7 DA 9D 1A BA D7 CE 8C 13 B1 98 D1 CF 14 AE 83 D4 80 15 D4 DA 9D A9 12 B0 9E CE 87 5B B0 92 C8 9D 1A B2 D7 D3 8A 0F A9 98 CF 84 5B B8 85 D2 82 5B AD 94 CF 8E 0F BD 9F B7 C2 5B 99 92 C9 CF 0B AB 95 D1 86 08 B6 92 D9 D0 5B 8D 9F D2 80 0F F2 D7 C9 87 1A AA D7 D0 86 1C B6 83 9D 8D 1E FE 96 9D 9C 0F AC 92 C9 8C 13","createdOn":1735590283053,"lastEdited":1738282443681,"tag":"🕊️ peace corps","title":"\"Broken\" Computers and Dreaming of a White Christmas"},"-OJdDSdcGhE2j9y4GdkC":{"content":"<em>note: The content of this website is mine alone and does not reflect the views of the U.S. Government, the Peace Corps, or the Paraguayan Government.</em>\n\n<em>cooler note: I added email notifications to my website! While in desktop view (sorry mobile users), click the bell icon in the top left of the blog feed and follow the prompts</em>\n\nA common phrase in Peace Corps circles is <em>\"The days are long, but the months fly by\"</em>. It's cornier than Kansas, but I guess that doesn't detract from the truth of it. It's hard to believe it's  February, and that it's already been nearly 9 months since Grace and I last set foot on American soil. I guess the proof is in the pudding -- since we left, the U.S. elected & inaugurated a new president (Elon Musk), the AI war has gone into full swing with the release of the open-source model, DeepSeek, and I am severely out of the loop on what movies do and do not exist (wait, there's a movie with Deadpool <em>and</em> Wolverine now?!?)\n\nFor New Year's, Grace and I went over to our host fam's house for a small celebration and asado. While things were pretty lowkey, it was definitely a bigger ordeal than Christmas. Our host parents' family and friends came from all over to enjoy a meal, and while the kids in the family played with small, presumably harmless (🤞) firecrackers near presumably durable (🤞) powerlines, Grace and I hung back with the adults to discuss intracacies of the English language, the different flavors of Coca Cola in other countries, and the subtle nuances in cultures we've encountered travelling around the world.\n\nShortly after New Year's, Grace and I embarked on a brief journey to Iguazu Falls on the border of Argentina and Brazil. Fun fact: the name \"Iguazu\" is actually the Spanish spelling of \"Yguazu\", directly translating to \"Big Water\" in Guaraní!. We stayed in a cute, touristy little town called Puerto Iguazu on the Argentinian side of the falls. While things were exorbanintly expensive (my wallet is crying), everything was worth it once we feasted our eyes on \"The Devil's Throat\" waterfall: the crown jewel of the park, a good couple hundred feet taller than Niagra Falls.\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczN3z2kjgdC8GG6qBM6lEYqfwkC53gip6aXgz1KsViGlPYgUctzQjButP1uRZQ_XXsRh2YfbIrv0As5HU_ZYMGu5CSeVSo18pxFPJLhzn9DzZbJ9adVd44bO41lS5rYA_voDPxPrrupDsGm0Xize4VFrhg=w2752-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>\"I'm taking an artsy photo of you\" -- Grace</em></figcaption>\n</p>\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczMhJuyy2bPpdp0-aRBoWL85rT_-UmfPJZby12YyBMVxenpHFDyCZ-uC5isAj-4dKBhQNLBKWyXHRTYTwqPd5nEQ83IWGidBSr_HZ7k5uNUeS4dpjtq_iN9b9whYowq546yICmsx1-jrywwTkwopJk5Kbg=w2752-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>Shoutout to the elderly Korean travel posse that took this picture for us!</em></figcaption>\n</p>\n\n\"Magical\" would be an understatement when describing the mystique of the park. Grace and I met up with a few volunteers while we were there and splurged on a speedboat ride that took us right up to (and under) the falls. It was like the <em> Jungle Cruise </em> at Disneyland on steroids -- more adrenaline, stunningly beautiful sights, and the subconcious knowledge that the caymans and canopies we saw weren't cheap façades of plaster and plastic, but rather the <em>real thing</em>.\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczMwwcH1847IHI6C9fTv_odkA9t3la-6mKuykNmYFLzdh5ydM4giyo8CPFl2QjmIGC49imatT2pYhylysFL2OHQSeaQxJtgujDVbQoPXw3VtSCRw65OuQl1WOrH2JtMyo_2dUrWk4Qq-vUWN9ZhKRyjbNw=w2358-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em> Water looked yuuuuuuge (when I could see it of course) </em></figcaption>\n</p>\n\nUpon getting back to site, we kicked off our summer camp, English classes, computation/electronics class, and youth sports club. While things were a hair shakey at the start, it didn't take long for Grace and I to hit our stride. At this point, it's like clockwork -- we've been having English classes Monday and Friday, computation classes and summer camp  on Tuesdays and Thursdays, and youth sports club meetings most evenings. Outside of that, when we're not planning our next set of classes and activities, we cool off in our hammocks or pass by our local USF to see if they need an extra hand with anything (making flyers, fixing computers, etc.).\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczMwGWO_z0suj7bN_jkyXApIDENDb-L2-kvJX-b40Lp1JjgiLHAeFuzvCh8NQKgHKzCkrxO8qTNrdeCzrDkaHBwhiEhqnioenq5lYkN5mp94ZDNzwBQ5hiwnPqygUGvRcaDVGZ8OIcOW1lxCEadB29i2-A=w1550-h1334-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>Refereeing water balloon volleyball</em></figcaption>\n</p>\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczPnkO0Ed-e26uWqahSk4jTKehJSmNlMHTxOPWmeJtAiq3JYRP6U5CyckzLbYc45lECtAXDKpYYas0lKJ62gMffZ40u9EOH6zSUusi6oJFc00Xhkgy4ieL9iMME1BPxkqXDFjtyAZiba8DJTuUSzvcezCA=w2752-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>Charming snakes</em></figcaption>\n</p>\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczMGLfKWpsBsaHIetORYcyLinewFtG_kPjCG_y3-pQMcYf23bKNLVpk-pIizyQ0VcUhFW9FZB0oYChjAxcQbeB5RJBY7Fjx7_kfIcR_Hglmeq_ZCZO0NarJUdUhm_7mQBYqScEukH_0sqk9XLPEx04HZhQ=w2666-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>Ohm's Law and breadboards</em></figcaption>\n</p>\n\nIn other news, while teaching one of our English classes, we came across a litter of 7 abandoned kittens! They were left in an engine beside the old train station where we teach our English classes, all hungry, filthy, and cute as hell. They couldn't have been more than a few weeks old, so Grace and I couldn't resist taking them in. Had we been privy to the weeks of bitten fingers, fleas, cacophonic cries, or stink that came with them, perhaps we would've hesitated a bit more in taking them in. I'm happy we did though; in the end, we found great homes for all of them (100% survival rate baby), one of which was with another volunteer in our cohort!\n\n<p align=\"center\">\n  <img height=\"200\" width=\"200\" src=\"https://lh3.googleusercontent.com/pw/AP1GczNcVmSjg1mWDBTRKJPWEa6pEiwLrLLsrOSneIp-Bx1fSYEQCQR8Ude-wplbhMgHD4MluQD88yLyo00ruK5WYD39NgS5YFBS-jTfQsjnUBkRWS4dS8aIk46yJkUMIyxVgmm4pWSAQFfbQLAyo0xWbxI0UA=w1549-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>Keeping warm...in 100 degree weather?!?</em></figcaption>\n</p>\n\n<p align=\"center\">\n  <img height=\"200\" width=\"200\" src=\"https://lh3.googleusercontent.com/pw/AP1GczOmipG8wvcGnUeSy19NXO-02qTALaUSuQH-qMCYJblYazctQe5E38g_8N004zfD_s18NNtlGLg6xkK7ejklStez0TvC5EFzGAkvgBAHEUVOqdxDCz2KOtuc-091-Kg6UJXurOoRPdn4URMFaubqxG4ILw=w1549-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>Feeding \"Garfield\" with a straw </em></figcaption>\n</p>\n\nAs I write this, summer is all but coming to an end. The ratio of school uniforms to stray cows we're seeing in the streets is growing little by little everyday, and daily temperatures are thankfully doing the opposite. This week, Grace and I are finishing up the last of our summer activities. Last week marked the end of our English classes, and this week marks the end of our computer class and summer camp. With hectic mornings and plans that fell apart day-of, this summer has been quite the rollercoaster! It's been exhausting, but it's the small things that make it worth it.\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczMp7T6q-aCPV-XJAui0fVzoAcZOVP9t73i1kZ1pxL2h1DOugskJcsfpKaHedJaTslHXus52H2yfNUhpyLGF8Ft-gezndEphLy7IxJ_sqZQEv1mWkVbiRAunWgjeMc_B2cIl6OWKHovRrmjA3E4byst-eQ=w2752-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>Anonymous note</em></figcaption>\n</p>\n\nBringing this blog to a close, I made a new friend recently! He's the same guy that cut my hair in the last blog, and his name is Alberto. We've been playing fútbol, drinking terere, and playing rounds of pool lately (I found out a few days back that someone owns a small table in our community!). He's quite the jokester, and he's never afraid to give me a (much needed) Guaraní lesson or (much needed) fútbol advice.\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczODwT_JG6rnmhr3HjWRC2QmJsGOqjVl0_LlWLalYuYDCKlQAAb2_8lb3MmfiMHjkHXSSaY8r7AGMpTw9xkJiqa-nZ0ZCya-nJUYfbWUWzi2vkCW9N8d7dCPFe8E45UP6LWWy1QlBRu4cgFMIzhvZdTUZA=w2752-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>\"These are just tortillas!\" -- Alberto</em></figcaption>\n</p>\n\nLast but not least, here's a few bonus photos and a sporadic list of things I want to remember: pool with Trieu & dueño, black tea and Socrates, venture to Will site & ice cubes on Rainbow, VR CD meeting, broken multimeter, wallet almost stolen in PI, pikmin bdays, A2 engage, monkey respect at the falls, fake valentine flowers, almost being a dog's dinner, wine & dine at lighthouse, dental charla numbers\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczO1ITgDo7iF4hBz_5U8VxamkdCZCR0gXMZ-fp1Ffy2DgliN3pZibCq63E4z05W1Q-BPVcPqJHrlyRhBLguF9ea5ZurYNsq2KuFG_udL7l1T_BM7Kvcam5-c__XHNDAIWzN5lNPNKVMBw02Wv3jWTsYEDw=w2752-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>(finally) Playing chess with my host bro-in-law </em></figcaption>\n</p>\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczMG7QSJ3uG3NEorEQz3d2AcbxnvtTdW7ot8TZbaF-KMMRVTm-Lj5Tr3k3pP_qCuunpZtChyPTLgwtJIciZAUP4x7ldj--mm1kj0f_p_W_icgI_lmogQ8NHkgAp9351qfj18qIYHJx0BicupXLwJKy1hcg=w654-h368-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>Getting bored and making a \"clapper\" for the house</em></figcaption>\n</p>","createdOn":1740153411615,"lastEdited":1745925817087,"tag":"🕊️ peace corps","title":"Big Water, Summer Camps, and Abandoned Kittens"},"-OOElMU8P3HOwZ5Eit2h":{"content":"<em>note: The content of this website is mine alone and does not reflect the views of the U.S. Government, the Peace Corps, or the Paraguayan Government.</em>\n\nCold weather has finally arrived here in Paraguay, and it couldn't have come any sooner. As of late, Grace's and my electricity bill has been skyrocketting to <em>Tres Kandu</em> levels, so the cold weather brings a financial comfort in addition to a physical one.\n\nShortly after the school year kicked off, Grace and I respun some of our summer activities to fit the new school-year schedule, and even added in a few new ones. At the moment, our general schedule in the afternoon involves going to the local <em>pista</em> and hosting a youth club meeting on Mondays, a \"mini\" summer camp for younger kids on Tuesdays, a guys' night and Zumba on Wednesday, a gals' night and exercise class on Thursdays, and \"free-for-all\" days on Fridays. While <em>fútbol</em> is naturally a favorite activity, we've incrementally been introducing ultimate frisbee, American football, and ping pong. For the last one, I haven't lost yet, despite the efforts of some pretty motivated community members (sorry Alberto!). We've also started co-teaching a P.E. class every Thursday and Friday morning at our <em>colegio</em> and hosting free community movie nights every Saturday evening.\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczMiKTF4kO-uux-07NCoChxhkLHf-6p0VxD4AWHrZTWwMlJfJSaGLE_PzaE2gLYOtlXBwKJ-TcfpwN21SluVXUCsDMaAriVlPkSaA8POs0OfN5h4U7IWQAm1FAwMQVjlgB3YeiRuCs4sc_yhEHtJCLZXpg=w2752-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>Inside-Out-side movie night</em></figcaption>\n</p>\n\nSince February, outside of continuing to work with youth and helping out in our USF (more on that later), Grace and I have gotten into the habit of going to the gym with our host brother. Serendipitously, we figured out that we can ride into town with our host brother and ride back to site with our USF doctor, avoiding the high bus fees that typicaly accompany the journey. It's an awesome arangement, and I'm happy to get back into going to the gym, but the catch is that we have to leave significantly before the buttcrack of dawn to do so...like, at 4:30AM...which means we've been having to wake up even before that 😢. It's all good though -- Grace and I have made a routine of getting up around 3:45AM, making oatmeal & coffee, and trying to knock out the NY times crossword before shipping out. Naturally, our bedtime has been that of super old people -- we try to hit the hay by 9 at the latest.\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczPoAoTfaVaXZ9VrAe41L94bsyN7Ziinlt4eEpROM9KR6Ie6DfYgvOk_Nlbe2gBDTBYVp0xGuktuohTrEGurZPl7HARdxKr-EjjKTaCqquzr-cYWf4LW4N1VXL7pC2bOauJZO39neQgAlNlkNXbC8Rwp4g=w1600-h1204-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>Morning pump (bout fell asleep mid-bench)</em></figcaption>\n</p>\n\nOn another note, I hinted at this in the last blog, but I've somewhat become the go-to \"tech help\" here in my community. I've helped fix slow / broken computers, wonky phones, and pesky printer problems pretty much from the first few weeks of getting here. However, that role might be coming to an end... I recently busted someone's 500Gb harddrive while trying to fix their computer.\n\nI know, I know, shameful. Long story short (techy talk incoming, skip if you don't care), someone's 15+ year old laptop in our USF was only booting into its OS about 10% of the time, so they gave it to me to take a look at it. I thought it might be a problem with the MBR on the hard drive, but even when I took it out, the device acted a little buggy when booting into the BIOS. Suspecting an outdated / messed up BIOS, I went ahead and tried to incrementaly update it using a spare flash drive with FlashDOS and the appropriate BIOS update file from Dell. All was going well, but while I was updating things, I accidentally knocked the hard drive I took out of the computer off my counter, sending it plumetting to the floor. I prayed to the computer gods that all was well (it wasn't a high drop, and the drive was powered off), but alas, the drive caught the click of death. With the computer pretty much damaged irreparably (as far as resources in Paraguay go), and my ego perhaps even more so, I went ahead and bought the busted computer at a premium. Ooof... still hurts like hell to think about.\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczPpJrDh_L4-PSSpavEGim_XlPj0AR2dHGk8ttaQNWgsSs9Ag5Gdbmd_v5XZwdgTesm95OUgjaCDb5GC5nwF5ByENJhyFtFs2kIWJQvng5rQ5lXKmpqgTgTFFXFUrVD3vwVTrGocA4YNeaVCf7BEyDfkZg=w2752-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>\"hAcKiNg into the mAiNfRamE\" (and trying not to brick a laptop)</em></figcaption>\n</p>\n\nMoving on, <em>Semana Santa</em> is coming to a close as a write this, and with it, so it seems are Grace's and my frequent gym seshes. Starting this week, our doctor will be on vacation for a while, meaning we won't have a ride to our community in the morning if we choose to go to the gym. As a result, our gym-going rythm will be taking a hiatus. It's a W for our sleep schedules, but an L for our gainz (😢). Fortunately, we've got a back-up plan: we've started <em>building</em> a gym for our community!\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczOb8y_IAr8QAuzbMIU43MTl_ZNn9U6Md2YvfyGIHUzAeAH5oJJX_HqEAGIdA3Td1hMG-swRwwJlBnTkoFXcnDvofO7A8Mz3yfTuntZCFtZU9gYaa3NdEt_e10zt8d-r4RHqtrXlGDOZOeCXwEpUUVN08g=w2752-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>Giving my poor hands a break from making wire mesh and taking this photo</em></figcaption>\n</p>\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczNhYMhalotroQ-Yqf7GTDq4Q3GPYzjbet2DUa3empc7PQZimdWn_0U2uCKTNNCA8MJBelerltYF1oUgQd3UqJoKDCZSXcT6_HApo9YWkU81VWSVDYYm8OFlbqBwlpIFxMCfvlAbQ7FhqPhW19WReIzCuA=w2752-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>Bringing in the big guns to help me out</em></figcaption>\n</p>\n\nI enlisted the help of my buddy Erick from one of the previous blogs to help us build the plates, as well as the help of some community members to help me gather and refine the materials for building other components of the gym. Progress is steady; we've already got some plates squared away and one squat rack planted. We definitely still have our work cut out for us, but I'm at least happy to have a project that entails building something with my hands.\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczNR4557aiCBLHxIDcyzYqXiz_pWm_UNMPLwiWF0nKByU5UK9ux6amnsvozv46cHqSplzH21n9a3L3bpUQTuSRfLekUO6hNir9PFUNLOhvT2f_GtVFZTTDvVgMBoSz6BMfBgE89-F4NBqeY14jiHOUJ35A=w2752-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>Sevelio, local carpenter and wood maestro</em></figcaption>\n</p>\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczPiVUY-0kZOZhrM7ifSMxLOkLHK-1x-_u95W6i3MPQdlquduKK1z191tfzlugsu_an22WWjkLhVnEaYn1mpYf8_0vuW8C9FS9Q3o-107lmAUQmPuBEtuyVlXmKv-fdHHidNwKWbYSmqEMboGEqdYE-fxg=w2752-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>Everisto, my wood guy (feat. my bad haircut)</em></figcaption>\n</p>\n\nGrace and I currently are passing an evening in (cue Nacho Libre voice) <em>Encarnación</em> to seek respite from an incredibily loud party that'll be going on till the wee hours of the morning next to our house. Come Monday, we'll be hitting the ground running with some math / reading initiatives for kids in the <em>escuela</em>, continuing work on the gym, and preparing a computer lab in our <em>colegio</em> (a super-awesome fellow volunteer clutched up and was able to bring some laptops to Paraguay from a <a href=\"http://labdoo.org/\">Labdoo</a> hub in Spain!). I already miss site, but it's nice to be somewhere different -- <em>Encarnación</em> is a lovely little town, but I will say the chairs are a little too small for my liking.\n\n<p align=\"center\">\n  <img height=\"200\" width=\"200\" src=\"https://lh3.googleusercontent.com/pw/AP1GczMS9f4e-h_Rw9TVrGRUUiUe9nyrHogEsK4PMQu7JiQqWTF02TtqR1ttfNFvZLM0vT8ySTgSWChTAoPPzUkzmEitlILDckk6v1xceOTTKoHeBBnCqHK4XUePjzEd6jTm8Cm28s_X_6OaHeKQhTCYW4Nrjw=w1549-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>#bigguyproblems</em></figcaption>\n</p>\n\nAnyways, closing things out for real, as always, here are a few  bonus photos and a list of things I want to remember: hombre-araña on the roof with photographers, baby driver, Paraguayan pins (loud music apparently), Q. spirits, corny dog, spacing out with <em>Interstellar</em>, medical separation, Swiss-Paraguay coffee, meeting Pedro, walking through a dining room to climb, P.E. gaslighting, LOL jokes, y chipa-making.\n\n<p align=\"center\">\n  <img height=\"200\" width=\"200\" src=\"https://lh3.googleusercontent.com/pw/AP1GczOHr_LFM3PLEXgW5aUkvN3KnIEEAK8QilyTJUSY8jH-ZHH6d8Ky3N48kQODbHGSto-PT88GTzOf8iycRslSbVpYkIP-Jmx6lExocSdNSYCwC7dkBxOvPV82grE3f86oujn3Nx0ogYoVv3bpOi1aepxlDw=w1549-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>\"Just one more glass for me\"</em></figcaption>\n</p>\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczOesTDzPx3E-FB-k2NlLzhwx5ExITUMxzP9D-AjUj7nYnmuho9FDXGvevN9SYYNB4i0RLDcOqBdJyOdXTtzTJ-cgpnL3fPq-6ugdhEupEqtVXizDKayQP5nbbaLVAzbMZW6tMJCo9x7vgA3IShBe-l-fw=w2752-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>\"Me regalas un X-Box por mi cumple?\"</em></figcaption>\n</p>\n\n<p align=\"center\">\n  <img height=\"200\" width=\"200\" src=\"https://lh3.googleusercontent.com/pw/AP1GczN-dkgMNOsYoW0jcz8zdg1V13R3yvPCS4yTD9kjbVMqPa_PG92EG6MoGkNE6M7J0ZI7fNJI4Av3N42FIYIo9Tq02y2N3R-X8G6SRHvCZus0AY0rFVmf-hDzooduuEQPClxvNQuXm1DJecJflmRVwl6L8w=w960-h1280-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>Chipa making during Semana Santa</em></figcaption>\n</p>","createdOn":1745095063500,"lastEdited":1759283234292,"tag":"🕊️ peace corps","title":"Early Mornings, (actually) Broken Computers, and Building a Gym"},"-OTEGn5fv0XPafOQbzFM":{"content":"<em>note: The content of this website is mine alone and does not reflect the views of the U.S. Government, the Peace Corps, or the Paraguayan Government.</em>\n\nI know, I know, it's been a hot second since I've written anything here. I'd love to chalk that up to being absurdly busy (which is perhaps a half-truth), but the reality is that I've simply preferred to spend my free time on <a href=\"http://chess.com/\">chess.com</a> instead of <a href=\"https://jacktnorris.dev/\">jacktnorris.dev</a> as of late 😂. I got beat by a few volunteers at the start of service...and I took that personally.\n\n<p align=\"center\">\n  <img width=\"300\" height-=\"300\" src=\"https://media1.tenor.com/m/mrobHvSIq5cAAAAd/it-became.gif\" />\n\n  <figcaption align=\"center\"> <em>\"From that point on, he's been on my list\" -- 🐐 </em> </figcaption>\n</p>\n\nIn all seriousness though, I'll be better about writing more consistently in the future! For now, I'll go ahead and chronicle how the past couple months have went.\n\nShortly after my last blog wrapped, Grace and I installed a weight stand for our community's outdoor gym with the help of few local kids. They insisted on helping (community-driven development for the win), and although it wasn't super Peace Corps health volunteery of me, I gave them a few (sugar-free) sodas for lending a helping hand.\n\n<p align=\"center\">\n  <img width=\"300\" height-=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczOxW6iE8Qw-4u994p8hw2LXmw14_UFoOYj85_m8c-_3YzDDAZv4FA9yG7Zxtf5tK4iZSudiBfzsVg4bmPShQBwK7x5HGaEA03DD8dx-uwqhfcOzJEFT5lCfeSkECL245U8K9Q62pAWDDVwf5PSAgHdvbQ=w2752-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"> <em>Witnessing concrete change first-hand </em> </figcaption>\n</p>\n\n<p align=\"center\">\n  <img width=\"250\" height-=\"250\" src=\"https://lh3.googleusercontent.com/pw/AP1GczMCvlHz3w4SI4dFbxOrIaXcfrKac7_E_VnmegBGM7W5gyk2nuE0uzOXlkoCnFKDOaFc4oqSywRrzNB7DedTXYWqyLaAjymTlldGeCk1MDxAvq745LcaCZY1wJAf2TbVb2xhFbj9Kp-xqwNvZm8CwshS5A=w1549-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"> <em>\"Cuándo vamos a hacer ejercicio?\" </em> </figcaption>\n</p>\n\nNot too long after we installed the stand, Master Trainer Brian (Grace's and my boss) visited our site to assess if our community would be a good fit to host the incoming Peace Corps trainees for a few days. We showed him around, introduced him to some possible host families, and even enjoyed a bit of ice cream. In the end, he got a kick out of the \"clapper\" I installed in our house, and he was happy enough with his visit that Grace and I will be hosting some trainees come July!\n\n<p align=\"center\">\n  <img width=\"250\" height-=\"250\" src=\"https://lh3.googleusercontent.com/pw/AP1GczPO8Wg_k2dstVKwLWGpMmXXTyOPkuOzSqNkffbGF516M-bQ4kPY8JWW11BvthEAqW3aUdYx5n7w5IpW1a0asj8asFJ1aeLSt8JmlbyB6tfO8iP_yd-omRvsmVB2MEvZq2CK-Jv1Kx6-OAhgRmnZMCcNwg=w960-h1280-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"> <em>\"Hold on, gotta take a picture...you look like a Peace Corps Volunteer!\" -- MST Brian </em> </figcaption>\n</p>\n\nA few days after MST Brian's visit, we caught a bus up north to explore the most rugged area of Paraguay: the Chaco. Backtracking a second here, a number of months ago, Grace and I befriended a missionary couple from the U.S that lived in a nearby <em>pueblito</em> -- a relationship that led to the occasional afternoon sharing a meal or some (non-instant 🙌) coffee. That couple moved to the Chaco around the start of April, and they offered to host Grace and I for a few days if we made the trek up to visit. Chomping at the bit to see our friends again (and the legendary Chaco), we caught a 12 hour bus to Filadelfia, a Mennonite colony and gateway city to the Chaco. Upon arrival, our days were filled with museum and nature site visits, tasty food, (non-instant 🙌) coffee, and board games. An added bonus was the <em> laberinto vegetal </em>, a corn-maze like labyrinth in the middle of nowhere that Grace and I raced to complete (at the request our missionary hosts). Not to brag...but <em>ella comió mi polvo</em>\n\n<p align=\"center\">\n  <img width=\"250\" height-=\"250\" src=\"https://lh3.googleusercontent.com/pw/AP1GczPKLobVyItzNxZaYcSgBQ9_78pZJyO3IhSRgBXTJJ64Ha6cMF-vPVjKdMRMrD7iNjDfNAa70OGAplhi23cnjbpfOqQvywVeKcB48eKZ2xjrANZIbiDY3EVm_N0Q9vBfLs7h-IU_CP69hDDb5NVHsJdzcQ=w1549-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"> <em> Chacos in the Chaco in a Chaco tree (5x fast)</em> </figcaption>\n</p>\n\n<p align=\"center\">\n  <img width=\"250\" height-=\"250\" src=\"https://lh3.googleusercontent.com/pw/AP1GczPeg_etzanZZPwzOBGZvHuLReN4FPmsnNhpOvdcrIRvmyNrWgHH1LQs1jwREV_BeoSXPWJnxLq6hSqxg9T4xovBKlrm1qH-c0_5iZQvRaHVmhphQc7ej3eQTHGxhpRNYghMN2-t3QesIVFzhS_k_OsOpw=w960-h1280-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"> <em> Labrat behavior </em> </figcaption>\n</p>\n\n<p align=\"center\">\n  <img width=\"300\" height-=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczN7wrhZlvXMeb-ndcPYB50lLURMsIqXXU8Oa0tEQ-a9AtPKnyVoJZXX9IbKPj06QbpbpUaNnVZ9t0_MXPVMkCUKBQd2GRlMeSOHNqJEiL49zsgPqVh4Csx4-JJJrdPGZzntXuSNfj83JF8KZxmztePLqw=w1280-h960-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"> <em> Teaching Codenames over milkshakes (ft. sus eyebrows) </em> </figcaption>\n</p>\n\nAfter spending a few days in the Chaco (and seeing some really awesome birds), Grace and I said goodbye to our missionary friends and embarked on a journey to the Peace Corps training center for a few briefings. Grace and I (along with a couple other volunteers) will be preparing the incoming class of trainees for life and work in Paraguay, so Peace Corps set aside a few days to brief us before the new group's arrival. Seeing the training center again was a blast from the past, and it was a real treat to see some old friends.\n\n<p align=\"center\">\n  <img width=\"250\" height-=\"250\" src=\"https://lh3.googleusercontent.com/pw/AP1GczPES3ondrPTi6BQJBNQui3B-OdEO5Vyc9B5dpmuAGRMFrFe1q4GY29RVJY0DsTFV5JvYAanxV1knP0bR-TQOexI3AxjpPlgnM2PJVfAcp8B66uG3hd2O7cpHBrhAKK3k0wicbYFiHTY5DBsW99L4jUeJA=w1200-h1600-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"> <em> Visit training center without breaking foot: ✅ </em> </figcaption>\n</p>\n\nUpon getting back to site, Grace and I continued with our projects as normal and finally opened up the community gym we've been working on to the public. At the moment, our main demographic is single moms and a handful of curious teens. However, as the gym grows to include some freeweights, a bench, and a bench rack, I'm hoping we can get a more marbled demographic.\n\n<p align=\"center\">\n  <img width=\"250\" height-=\"250\" src=\"https://lh3.googleusercontent.com/pw/AP1GczO6Yl7XvOAwjAke62lDXWOMgCHtzKUx8KmRQIyULaXfHKQde9LMc7HIhWPeYlbUYD_kiaarLOUVXN_w3LUbBSAY24gMhWo6ow2NBN-v9P5GyGzQ7n6sks9lI8hxyRgUs7ljzay--7q1PalVpREzYNhvOg=w2752-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"> <em>\"Light weight, baby!\"</em> </figcaption>\n</p>\n\nSpeaking of a bench rack, I once again enlisted the help of my buddy Sevelio (maestro of wood) to help me cut some wood. Upon arriving at his shop/house, in place of Sevelio, I was greeted by a man as verbose as Silent Bob, yet with a face as demonstrative as Jim Carrey's. Once Sevelio pulled up, I learned this mystery man was 1) Sevelio's wife's cousin, 2) an incredibly successfuly carpenter from Asunción, and 3) mute ever since childhood. Given we both spoke approximately the same amount of Guaraní, Sevelio's cousin and I hit it off pretty well, and I can confidently say he's probably one of the funniest people I've met in Paraguay! Physical comedy was his specialty, which is a pretty daring feat when you're working as a carpenter.\n\n<p align=\"center\">\n  <img width=\"300\" height-=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczM_R0ztAQqw39HsEwFzAORLSzZEx3jkcVM9usnuf6spjZXNt4wS8gQytUO8GHPrYYeb69B6HGhdzaWWRf_7KQTMN7iPGU_cN1xt9y4BZI390F71PxLOxcBW5UQud6JLrPnfXxmzW7ck5N56lPjUU9KXww=w2752-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"> <em> Putting their blood (literally), sweat, and tears into their work </em> </figcaption>\n</p>\n\nSevelio gifted me some mandarinas and mandioca in return for cutting my wood (in typical, generous, Paraguayan fashion). However, despite living in Paraguay for a year, I had no clue how to prepare mandioca -- this was the first time I'd been gifted it fresh out of the ground. Grace had prepared it once with our host mom, but she was gone for the week helping out with PST. Too prideful to ask my host mom for help and get laughed it, I went ahead and called up my buddy and barber, Alberto. What ensued was a memorable evening of mandioca peeling, asaditos, and <em>Soldados o Zombies</em>, a tragically discontinued show on Amazon Prime.\n\n<p align=\"center\">\n  <img width=\"300\" height-=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczMeZ2XAqqsAQ9akjpgqmJ_FpYPG8SJeUPnnd-vlJ8UJ9u6EvQFSN9MrHJXawiWO1H2sAw3lAp3zIrMZamGM4qhM6KVFJ1nQ_Sdk9zEjGMfep7a70T7pGYWi7z0h_HxZwk7M46q6sauh3mRrx-2Tae4N8Q=w2752-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"> <em> \"I'm gonna peel my 3 before you peel your 1!\" -- Alberto  </em> </figcaption>\n</p>\n\n<p align=\"center\">\n  <img width=\"300\" height-=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczORYrMNLOOFu5Lw7A3W8hzweVJhLn7K5dTOCOui3SMjTKmT_eSb667XUcWh_gW0VpGienczWZQ-Jm3cdLXhvogUDeFsy06_FFjoXZdO0HM6ruSl1jDVF93Vlrx_phshI46_7GQlEbuEqssgJATQM5mvqA=w2752-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"> <em> Buen provecho  </em> </figcaption>\n</p>\n\nAnyways, Grace just got back from her PST work a few days ago, and she arrived just in time to celebrate our host niece's first birthday! Paraguayans go hard in the paint when it comes to partying (even if it's just for a 1 year old), so Grace and I ended up having to turn in for the night long before the festivities actually ended. Regardless though, while we we were there, we had an awesome time celebrating with our host family.\n\nAt this point, Grace and I have already passed the 1 year mark in our service. While I admit it hasn't felt like we've done a ton, retrospecting on the relationships we've built over the past year (both in and out of site) tells a different story--kids race to hug us when we stroll into the <em>esceula</em>, parents trustfully send their <em>niños</em> to our events, and the teens and our community have warmed up to us drastically, with some of even the quietest ones coming to greet us in the streets. Countless community members have offered and contributed their time, tools, or resources for projects we have in the community. And of course, my Spanish is leagues better than it was when we first started our journey here.\n\n<p align=\"center\">\n  <img width=\"300\" height-=\"300\" src=\"https://media1.tenor.com/m/HFPAc0DDB14AAAAd/la-telefona-el-telefono.gif\" />\n\n  <figcaption align=\"center\"> <em> Accurate representation of Grace and I when we got here</em> </figcaption>\n</p>\n\nNot to rest on these (small) laurels, Grace and I know the job is not finished -- we still have a few projects we'd like to get off the ground and running sustainably before the end of service, leveraging the relationships we've been able to build thus far. As to what those projects are...you'll just have to wait and see 😉. Signing off, as always, here's that sporadic list I want to remember in addition to a few bonus photos: beach boys vacation with my parents, HORSE ankle, Chaco mosquitos, Nivacle visit, cured ears, duck ring toss, 3 / 1 = ? , pho double date, grapefruit haircut & finding Jesus, craaaazy message, book headache, pool & tacos & red dead sendoff, Spanish Thunderbolts, meeting a professor a few connections away from a Nobel Prize Winner, <em>chivivi</em> dog-like cat, killer gym-bro cabal, trespassing fruits, losing (the) will, commandeered billiards, fire-spitting power cord, coca-cola vacation tower.\n\n<p align=\"center\">\n  <img width=\"300\" height-=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczMhsyA7ycy1QvXUJJnDTV--fOuyOKy8l-jEY0wM3Df3pdP1P1uHC6sKfGRga0CXD8_uuiW7rmSmhOysglEcyXUPV9CmhH90JEGsZd2HHsLsKE90VoXqkJ6ycXdynDjL6FSiosloq3_NYBSYh38hMHb4Lw=w1280-h853-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"> <em>Paraguayan independence day with profes</em> </figcaption>\n</p>\n\n<p align=\"center\">\n  <img width=\"300\" height-=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczPPa8WyDJl2UGY4F8_qaiTfqhisHvCpGzNqhL-dOl2f85G5uFDqu6TLy5tFBqzGJJlnJsXpkuwltUF4_8vir5DDRL9_kHb7WcDL3GfIUan662ChlWki9KAw7fv5T3_R292cTd0o3bu5sqpDj1n9cbM7-g=w1280-h960-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"> <em>Jajotopata missionaries! </em> </figcaption>\n</p>\n\n<p align=\"center\">\n  <img width=\"300\" height-=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczP7WImewlMU277Bi3Y5e1AaHGNevDNeqPSJHi88Xhv1UMQNQ0oFgYilLf6yUH7-38I9dqiB36BgQFrH-mlH3GDfx4SyA7OmfTdOiqCmNCI721Dw89Y16onevWGzGUJqv3iMGS01pwnVFDN1M5T7kWRtLQ=w1600-h1200-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"> <em>Literally the only bouldering wall in all of Paraguay</em> </figcaption>\n</p>\n\n<p align=\"center\">\n  <img width=\"300\" height-=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczNyIASoHG_AQVDwkKK-pMF_4t28iPQRfDuESY1DeQGLSevBLtOjo-70i8FVts7PCD2ZT6ygOrvD9Z0k9FJryDuNSRVh5cTCsdSTXfcNgxIUMz6_NXWcHaQzZQ5yXDWtF9zfGSlJwt-EluIGWGs-AcORow=w2752-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"> <em>Chess club opening</em> </figcaption>\n</p>\n\n<p align=\"center\">\n  <img width=\"300\" height-=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczNK-zTzTDAHy4IdHzou-XD6f8-MMQxXSDRLK5eIVXEBQWN1ALIKFGrkFofT2INZuEGXh9zHkqv5mh5Xxm045hssLrfYQ4djs5Czsb8_OECgjqWky9viX9RqFcp4ozrzqVuiZJFGn4x-CZt6s-WkbNhQGQ=w2752-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"> <em>Long overdue reunion with my parents</em> </figcaption>\n</p>","createdOn":1750455496941,"lastEdited":1750455561956,"tag":"🕊️ peace corps","title":"Chaco Trees, Mute Carpenters, and a Mandioca Peeling Competition"},"-OWNPyJ0_IEfwVLqH9J1":{"content":"*note: this blog assumes a working familiarity with the basics of machine learning and calculus.*\n\nAs of late, I've been trying to implement a neural network in C++ completely from scratch using minimal libraries (Eigen being the principal one used). After countless hours debugging some (messy) code and grappling with the syntax of a language as verbose as C++, I had a basic multi-layer neural network...that ran slow as crap and was a little buggy. My hopes of expanding it to encompass convolutional layers died right then and there, and as I read more into neural network implementations, I realized I neglected the important implementation of <em>automatic differentiation</em> (which explained some of the funky truncation errors I was getting). I've decided to pivot to a Python implementation of a neural network, but before starting, I wanted to code up some basic automatic differentiation.\n\n<h3>What is Automatic Differentiation (AD)?</h3>\nFor starters, <em>what the hell is automatic differentiation</em>? Thinking back to Calculus I, we have the following definition of a derivative:\n\n$$\n\\lim_{\\Delta{h}\\rarr{0}}\\frac{f(x + \\Delta{h}) - f(x)}{\\Delta{h}}\n$$\n\nIt layman's terms, consider a function, $f(x)$. Now, let's say you want to know how \"steep\" the function is at point $A$. To do this, you pick another point to the right, point $B$, and calculate the slope of the straight line connecting them. Keeping $A$ stationary, you move point $B$ closer to $A$ and recalculate the slope. If you keep doing this until $A$ and $B$ are practically the same point you've converged on the <em>instantaneous rate of change</em> of the function at point $A$, also known as the <em>derivitave</em>. Now, you know how \"steep\" the function is at point $A$.\n\nComputationally, you can calculate the derivative of a function $f(x)$ at a given point simply by plugging in a minutely different point and calculating the slope between them. This form of differentiation is known as <strong> numerical differentiation </strong>. For example, if $f(x) = x^2$, you can estimate the derivative of $f(x)$ at $x$ = 2 (i.e. $f'(2)$) with the following\n\n$$\nf'(2) = \\frac{f(2 + 0.0000000001) - f(2)}{0.0000000001} = \\frac{2.0000000001^2 - 2^2}{0.0000000001} = 4.00000033096\n$$\n\nTechnically, $f'(2)$ is equal to 4, so when it comes to this approach, there's a bit of a trade-off when it comes to the exactness of your answer. While this isn't a huge issue for a function this simple, when we calculate the gradients of a loss function for a sufficiently complex neural network, you can imagine that this error compounds rather quickly. Additionally, computers can only get so precise with repeated floating point operations.\n\nAlternatively, there's <strong>symbolic differentation</strong> (which is what most people are used to from their high school calculus class). For the function $f(x) = x^2$, using simple derivative rules we know that $f'(x) = 2x$, and that $f'(2) = 4$. Booyah, we have the exact answer to $f'(2)$!\n\nComputers more or less can perform a similar process, but the problem with this approach lies in something called <strong>expression swell</strong> -- a phenomoenon in which the size and number of expressions involved in a calculation grows dramatically as the calculation progresses. If you've ever had a seemingly \"nice\" homework problem from your calculus class blow up into a few pages to solve, you've experienced this first-hand. Consider the following function and its derivatives:\n\n$$\nf(x)=(sin(x^2+3x+1))^4\n$$\n$$\nf'(x)=4(sin(x^2+3x+1))^3⋅cos(x^2+3x+1)⋅(2x+3)\n$$\n$$\nf''(x) = 4(2x + 3)^2 \\left[ 3 \\left( \\sin(x^2 + 3x + 1) \\right)^2 \\left( \\cos(x^2 + 3x + 1) \\right)^2 - \\left( \\sin(x^2 + 3x + 1) \\right)^4 \\right] + 8 \\left( \\sin(x^2 + 3x + 1) \\right)^3 \\cos(x^2 + 3x + 1)\n$$\n\nOn just the second derivative, the expression has exploded to be significantly larger, with many operations even being repeated. Neural networks represent mathematical equations even more complex than the equation above. As such, symbolic differentiation quickly becomes a non-tractable solution to complex differentiation on a computer.\n\nAutomatic differntiation gives us a method of computing exact derivatives efficiently, meaning we circumvent the problems of expression swelll while simultaneously skirting the truncation and precision errors that come with numerical differentiation. It does this by leveraging the chain rule and <strong>computation graphs</strong>: directed acyclic graphs (DAG) that represent the operations of a mathematical expression.\n\n<h3>How Does Automatic Differentiation Work?</h3>\n\nLet's consider the following function and its associated computation graph:\n\n$$\nf(x_1, x_2) =  x_1^2 + 4x_2 - \\frac{x_1}{x_2} + sin(x_1)\n$$\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://gist.github.com/user-attachments/assets/4c784cce-3897-485b-ade9-3ab3030f5b91\" />\n</p>\n\nCalculating $\\frac{\\partial f}{\\partial x_1}$ and $\\frac{\\partial f}{\\partial x_2}$ symbolically (so we can verify our AD approach later), you'll get the following results:\n\n$$\n\\frac{\\partial f}{\\partial x_1} = 2x_1 - \\frac{1}{x_2} + cos(x_1)\n$$\n\n$$\n\\frac{\\partial f}{\\partial x_2} = 4 + \\frac{x_1}{x_2^2}\n$$\n\nTo arrive at this result via automatic differentiation, first consider the partial derivative of $f$ with respect to its intermediary components (i.e. \"locals\"), $b$ and $d$. Given that $f = d - b$, from basic derivation rules we know that $\\frac{\\partial f}{\\partial d}$ = 1 and $\\frac{\\partial f}{\\partial b} = -1$.\n\nFantastic, but how does this help us come up with $\\frac{\\partial f}{\\partial x_1}$ and $\\frac{\\partial f}{\\partial x_2}$ ? The answer lies in the <strong>chain rule</strong>, written in a slightly different form below than the normal $\\frac{d}{dx}f(g(x)) = f'(g(x)) g'(x)$ form we see:\n\n$$\n\\frac{dz}{dx} = \\frac{dz}{dy}\\frac{dy}{dx}\n$$\n\nCutting to what this means intuitively, if a change in $x$ results in a change in $y$, and a change in $y$ results in a change in $z$, a change in $x$ <em>must</em> result in a change in $z$. The behaviors of these functions are <em>chained</em> together so to speak, and that relationship is summed up with the rule above.  We can leverage this fact to calculate $\\frac{\\partial f}{\\partial x_1}$ and $\\frac{\\partial f}{\\partial x_2}$ via the partial derivatives of the locals in the graph above:\n\n$$\n\\frac{\\partial f}{\\partial x_1} = \\frac{\\partial f}{\\partial d} \\frac{\\partial d}{\\partial a}\n\\frac{\\partial a}{\\partial x_1} + \\frac{\\partial f}{\\partial d} \\frac{\\partial d}{\\partial c}\n\\frac{\\partial c}{\\partial x_1} + \\frac{\\partial f}{\\partial b} \\frac{\\partial b}{\\partial x_1}\n$$\n$$\n\\frac{\\partial f}{\\partial x_2} = \\frac{\\partial f}{\\partial b} \\frac{\\partial b}{\\partial x_2} + \\frac{\\partial f}{\\partial d} \\frac{\\partial d}{\\partial e}\\frac{\\partial e}{\\partial x_2}\n$$\n\nNow, a thing to note is that our partial derivatives look a little weird in this case -- why am I summing quantities together? Doesn't the chain rule just say to multiply derivatives? In reality, the there are multiple \"paths\" in which $x_1$ and $x_2$ contributes to $f$:\n$$\nx_1 \\rightarrow c \\rightarrow d \\rightarrow f\n$$\n\n$$\nx_1 \\rightarrow a \\rightarrow d \\rightarrow f\n$$\n\n$$\nx_1 \\rightarrow b \\rightarrow d \\rightarrow f\n$$\n\n$$\nx_2 \\rightarrow e \\rightarrow d \\rightarrow f\n$$\n$$\nx_2 \\rightarrow b \\rightarrow f\n$$\n\nIf a variable influences the output through multiple intermediate paths, <em>then each path contributes to the total derivative </em>. As such, when calculating a \"global\" partial derivative, we must calculate  the sum of the chain rule applied on <a>all local partial paths from source (input) to sink (output)</a>. The following shows the global partial derivative calculation, step by step for each of our inputs, $x_1$ and $x_2$. As you can see, both AD and symbolic differentiation yield the same results. First, we have the partial derivative calculation for the \"locals\":\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://gist.github.com/user-attachments/assets/b1f733dc-2559-4d92-900d-d9a0ec1b9033\" />\n</p>\n\nThen, we calculate the partial derivatives with respect to $x_1$ and $x_2$ using the equations we derived from the chain rule above:\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://gist.github.com/user-attachments/assets/54643d2f-c70e-414a-a26d-7cec0867b26a\" />\n</p>\n\n<h3>But How the Hell Do I Code This?</h3>\nTo actually code this up in Python, we'll be taking advantage of a concept called <a href=\"https://en.wikipedia.org/wiki/Operator_overloading\">operator overloading</a>. Let's start things off by creating the following <em>Value</em> class.\n\n```js\nclass Value:\n    def __init__(self, data, _children=()):\n        self.data = data\n        self._prev = set(_children)\n        self.grad = 0.0\n        self._backward = lambda: None \n        \n    def __repr__(self):\n        return f\"Value({self.data})\"\n        \n# using our class\na = Value(3)\nb = Value(4)\n```\n\nHere, the <em>Value</em> object represents a given node in our computation graph (specifically the components represented with circles). We've got 4 members defined in the constructor:\n\n<ul>\n  <li> <strong>data</strong>: holds the float value of a node. We'll be using AD to calculate derivatives at a specific point (i.e. a specific input value), so we'll need to keep track of out the inputs affect the values of locals</li>\n  <li> <strong>_prev</strong>: stores the nodes of the DAG that were used to calculate the current value object (if any)</li>\n  <li> <strong>grad</strong>: stores the partial derivative for the current <em>Value</em> object . Initialized to zero at the start</li>\n  <li><strong>_backward</strong>: a function that defines how the gradient of this node should be distributed to its input nodes during backpropagation. In other words, it specifies how changes in this node influence the nodes it depends on (we’ll break this down further shortly).</li>\n</ul>\n\nAt the moment, there isn't much we can do with this class outside of create some rudimentary containers for data. Let's beef up our class with a bit of operator overloading:\n\n```js\n    def __add__(self, other):\n        if isinstance(other, (int, float)):\n            other = Value(other)\n        out = Value(self.data + other.data, (self, other))\n        def _backward():\n            self.grad += 1.0 * out.grad\n            other.grad += 1.0 * out.grad\n        out._backward = _backward\n        return out\n      \n    def __mul__(self, other):\n        if isinstance(other, (int, float)):\n            other = Value(other)\n        out = Value(self.data * other.data, (self, other))\n        def _backward():\n            self.grad += other.data * out.grad\n            other.grad += self.data * out.grad\n        out._backward = _backward\n        return out\n        \n    def __pow__(self, other):\n        assert(isinstance(other, (int, float)))\n        out = Value(self.data ** other, (self, ))\n        def _backward():\n            self.grad += other * (self.data ** (other - 1)) * out.grad\n        out._backward = _backward\n        return out\n        \n    def tanh(self):\n        x = self.data\n        t = (math.exp(2*x) - 1)/(math.exp(2*x) + 1)\n        out = Value(t, (self,))\n        def _backward():\n            self.grad += (1 - t**2) * out.grad\n        out._backward = _backward\n        \n        return out\nA = Value(3)\nB = Value(4)\nC = a + b\nprint(c) # Value(7)\n```\n\nWith these methods, we can now add together, multiply together, and raise to a power <em>Value</em> objects. We also now have the ability to take $tanh$ of a given <em>Value</em> object. Now, anytime we perform an operation on a <em>Value</em> object, we return a new object that \"remembers\" the values used to calculate it via its <em>child</em> member (in this case, $C$ \"remembers\" that it is the sum of $A$ and $B$). We also prescribe a <em>_backward</em> function to the outputted object of a given operation. I know it's a tad unclear as to what exactly this does at this point, so let's break it down with an example. Consider the following function.\n\n$$\nf(a, b) = tanh(a + b^2)\n$$\n\nNow, consider its (better formatted) computation graph when we're trying to calculate $\\frac{\\partial f}{\\partial a}(0.5)$ and $\\frac{\\partial f}{\\partial b}(0.5)$\n\n<p align=\"center\">\n  <img height=\"300\" width=\"800\" src=\"https://gist.github.com/user-attachments/assets/c3b07b93-8e03-4ed8-b3e3-348714e0c56d\" />\n</p>\n\nHere we have the code representation of the computation graph:\n\n```js\na = Value(0.5)\nb = Value(0.5)\nc = b**2\nd = a + c\nf = tanh(d)\n```\n\nZooming in on the $f$ node, we know it has the following properties:\n\n<ol>\n  <li> <strong>data</strong>: 0.6351, which is f(0.5, 0.5)</li>\n  <li> <strong>_prev</strong>: node d</li>\n  <li> <strong>grad</strong>: 0.0</li>\n  <li><strong>_backward</strong>:</li>\n</ol>\n\n```js\n# defined when we call tanh(d)\ndef _backward():\n  # self is node d in this case\n  # \"t\" is tanh(d) in this case\n  self.grad += (1 - t**2) * out.grad\n```\n\nHere, \"out.grad\" refers to the <em>grad</em> property of $f$, and self.grad refers to the <em>grad</em> property of node $d$ (this might be a little trippy, depending on your familiarity with OOP and Python but I encourage you to verify this yourself).\n\nNow, we logically know that $\\frac{\\partial f}{\\partial f} = 1$, so we can set its gradient as such, then call its <em>_backward</em> method to calculate $\\frac{\\partial f}{\\partial d}$. When we do this, we get the following computation graph (highlighted parts indicate updated values):\n\n<p align=\"center\">\n  <img height=\"300\" width=\"800\" src=\"https://gist.github.com/user-attachments/assets/2b5f08ba-8d46-4d5d-a354-d0fb0fe9352b\" />\n</p>\n\nIn other words, $\\frac{\\partial f}{\\partial d} = 1 - (0.6351)^2 = 0.5966$, which follows from the basic derivative rules of calculus.\n\n$$\nf = tanh(d)\n\\therefore\n\\frac{\\partial f}{\\partial d} = (1 - tanh^2(d))\n$$\n\nLet's go ahead and \"send back\" the gradient of $d$ to nodes $a$ and $c$ with its <em>_backward</em> function and take a look at the computation graph:\n\n<p align=\"center\">\n  <img height=\"300\" width=\"800\" src=\"https://gist.github.com/user-attachments/assets/c2263b18-7760-4f02-9944-f71684bf789a\" />\n</p>\n\nNow, recall that the \"grad\" member for a node represents it's partial derivative ($\\frac{\\partial f}{\\partial a}$ and $\\frac{\\partial f}{\\partial c}$ for nodes a and c). Additionally, recall from the chain rule that:\n\n$$\n\\frac{\\partial f}{\\partial a} = \\frac{\\partial f}{\\partial d} \\frac{\\partial d}{\\partial a}\n$$\n$$\n\\frac{\\partial f}{\\partial c} = \\frac{\\partial f}{\\partial d} \\frac{\\partial d}{\\partial c}\n$$\n\nNow, given that $d = a + c$, then $\\frac{\\partial d}{\\partial c} = 1$ and $\\frac{\\partial d}{\\partial a}$ = 1. Subsequently, according to the chain rule:\n\n$$\n\\frac{\\partial f}{\\partial a} = \\frac{\\partial f}{\\partial d} \\frac{\\partial d}{\\partial a}  = \\frac{\\partial f}{\\partial d} × 1 = \\frac{\\partial f}{\\partial d}\n$$\n$$\n\\frac{\\partial f}{\\partial c} = \\frac{\\partial f}{\\partial d} \\frac{\\partial d}{\\partial c}  = \\frac{\\partial f}{\\partial d} × 1 = \\frac{\\partial f}{\\partial d}\n$$\n\nwhich is exactly how we land at the gradients of $a$ and $c$ being $\\frac{\\partial f}{\\partial a} = \\frac{\\partial f}{\\partial c} = 0.5966$ in this context. You can verify that this is how $\\frac{\\partial f}{\\partial a}$ and $\\frac{\\partial f}{\\partial c}$ are calculated by looking at the <em>_backward</em> function for the $d$ node. Finishing things out and backpropogating the gradient of $c$ to $b$, we get the following computation graph:\n\n<p align=\"center\">\n  <img height=\"300\" width=\"800\" src=\"https://gist.github.com/user-attachments/assets/85173757-5336-42f0-81b1-d744630ecab0\" />\n</p>\n\nNow, while it seems like $b$ simply \"inherited\" the gradient of $c$, that's really just a side effect of the numbers we chose. Since $c = b^2$, we know from basic derivative rules that $\\frac{\\partial c}{\\partial b} = 2b$. Now, from the chain rule, we know the following:\n\n$$\n\\frac{\\partial f}{\\partial b} = \\frac{\\partial c}{\\partial b} \\frac{\\partial f}{\\partial c}\n$$\n\nNow, since we know $b = 0.5$ we can now calculate the numerical value of $\\frac{\\partial c}{\\partial b}$, as well as $\\frac{\\partial f}{\\partial b}$:\n\n$$\n\\frac{\\partial c}{\\partial b} = 2b = 2 × 0.5 = 1\n$$\n$$\n\\frac{\\partial f}{\\partial b} = \\frac{\\partial c}{\\partial b} × \\frac{\\partial f}{\\partial c} = 1 × 0.5966 = 0.5966\n$$\n\nWe've thus arrived at the values of $\\frac{\\partial f}{\\partial b}$ and $\\frac{\\partial f}{\\partial a}$ when $a = b = 0.5$, which you can verify yourself via symbolic differentiation. With this process, hopefully you've intuitively discovered what the <em>_backward</em> function does for us: it helps us recursively apply the chain rule to locals in our computation graph.\n\nNow, in place of manually calling the <em>_backward</em> function for every node in our graph (in the correct order), let's write a function that will call the <em>_backward</em> function all the way back from one node to all the nodes that precede it. This isn't an algorithms course, but we pretty much perform a topological sort of the nodes in our graph (i.e. order nodes in a line such that each node's value doesn't depend on the values of the nodes in front of it), reverse that, and call the <em>_backward</em> function on each.\n\n```js\n    def backward(self):\n        # start off with a topological sort of computation graph\n        topo = []\n        visited = set()\n        def build_topo(v):\n            if v not in visited:\n                visited.add(v)\n                for child in v._prev:\n                    build_topo(child)\n                topo.append(v)\n        build_topo(self)\n\n        self.grad = 1.0  # Initialize the gradient of the output\n        for node in reversed(topo):\n            node._backward()\n```\n\nNow, we can call the <em>backward</em> method on a given <em>Value</em> object to calculate the partial derivatives of all nodes in our computation graph!\n\n```js\na = Value(0.5)\nb = Value(0.5)\nc = b**2\nd = a + c\nf = tanh(d)\nf.backward()\nprint(\"df/da: \", a.grad) # df/da: 0.5966\nprint(\"df/db: \", b.grad) # df/db: 0.5966\n```\n\n<h3>Conclusion & Acknowledgements</h3>\n\nAnd with that, we've coded up a very barebones automatic differentiator. We can represent a wide range of mathematical expressions via our <em>Value</em> class, then easily calculate their derivatives via the <em>backward()</em> function we defined. To sum things up, automatic differentiation allows a computer to calculate derivatives efficiently and (near) exactly by breaking a mathematical expression into simpler components and recursively applying the chain rule to each of its parts. Although the class we defined is fairly rudimentary, it can easily be expanded to support other operations and dimensions (which I'll 100% do in the future before building out a neural net).\n\nIf you want the full code for the class developed in this blog, you can find it <a href=\"https://gist.github.com/JackTNorris/8dbefd570146ec70558faf41bc97257c\">here</a>. As something to note, we covered <strong>reverse-mode automatic differentiation</strong> in this blog -- forward-mode also exists, but I figured for simplicity and its applications in ML, reverse-mode would be sufficient. This work was heavily inspired and guided by the 🐐, Dr. Andrej Karpathy, specifically his <a href=\"https://karpathy.ai/zero-to-hero.html\">\"Zero to Hero\"</a> course.","createdOn":1753830122749,"lastEdited":1754353159599,"tag":"🧮 math","title":"Simple Automatic Differentiation in Python"},"-OX2-_pWXaqqUHuiQCQ-":{"content":"*note: this blog picks up where I left off in my auto differentiation blog*\n\nIn the last blog, I built a small framework for simple automatic differentiation in python. As I alluded to there, my main goal with that project was to establish a stepping stone for building a neural network from scratch. With this blog, we continue on that path by implementing multidimensional automatic differentation. Specifically, we'll be refactoring our <em>Value</em> class to handle tensor operations with Numpy.\n\n<h3>Numpy and Tensors</h3>\n<strong>Numpy</strong> is an open-source library for mathematical computing that provides support for working with multidimensional arrays and matrices. It's heavily used in the scientific research community, and its underlying funcionality is written in highly optimized C – Python really just serves as a thin \"wrapper\" around those function implementations. Numpy arrays behave quite similarly to normal Python arrays, but they come with a decent number of cool features that we'll dive into shortly (but here's a neat example of what they can do for now):\n\n```python\nimport Numpy as np\na = np.array([1, 2, 3, 4])\na * 2  #[2, 4, 6, 8]\n```\n\n<strong>Tensors</strong> are mathematical objects that are best described as \"multidimensional arrays\" (for the more computer science inclined). Vectors and matrices are both simple examples of tensors (of 1-D and 2-D respectively) that you might've already encountered. With regards to higher dimensional tensors, you can imagine the representation of a 1024x1024 color image with a 3D array of size (1024, 1024, 3) – the first 2 dimensions identify the location of the pixel, and the third specifies the RGB color value of that pixel. Expanding to a 4-D tensor, you might imagine the representation of 1 second of video at 60FPS with a tensor of size (60, 1024, 1024, 3).\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjDHz3vzWUlMvMxPyQCKnJkNEbs6RsT9c5H80sNjSy1DX6Dmc8o5MpCxYjg7YuFa6mAtJuse9RTWWnetBpjBbutP6OY5kCbui4aaHMYsC5fHKEnKOoJ0lDlMRXG0GIrHo34LFuNhCDbKOQ5nOfC60ZXdzGutHXfoAUbbi78XoXoVI_xeuJMpoTt1F_F/s1600/image1.png\" />\n\n  <figcaption align=\"center\">A 4D Tensor Visual Example</figcaption>\n</p>\n\nTensors are important in the context of machine learning since they give us an efficient, organized manner of representing high-dimensional data (and a set of rules for performing operations on them). I won't get too much into the weeds here (since I'll explain that in a more ML-heavy blog), but the main thing to take away here is that tensors are an important tool to leverage when inputting high-dimensional data into a neural network. Naturally, if we want to build out a versatile automatic differentiation framework, we need to build in multi-dimensionality.\n\n<h3>Jumping into the Code with a Tensor Class...</h3>\nStarting things off, we'll go ahead and define ourselves a <em>Tensor</em> class, and fill it with some of the methods we've already seen in the <em>Value</em> class. Most things will stay the same, but a few things in particular are are going to have to change:\n\n```python\nclass Tensor:\n    def _unbroadcast(self, grad, shape):\n        if grad.shape == shape:\n            return grad\n        while len(grad.shape) > len(shape):\n            grad = grad.sum(axis=0)\n        for axis in reversed(range(len(shape))):\n            if shape[axis] == 1 and grad.shape[axis] != 1:\n                grad = grad.sum(axis=axis, keepdims=True)\n        return grad\n\n    def __init__(self, data, _children=(), _op='', label=''):\n        self.data = np.array(data, dtype=np.float32)\n        self.grad = np.zeros_like(self.data)\n        self._prev = set(_children)\n        self._op = _op\n        self.label = label\n        self._backward = lambda: None\n\n    def __repr__(self):\n        return f\"Tensor(data={self.data}, grad={self.grad})\"\n\n    def __add__(self, other):\n        other = other if isinstance(other, Tensor) else Tensor(other)\n        out = Tensor(self.data + other.data, (self, other), '+')\n        def _backward():\n            self.grad += self._unbroadcast(out.grad, self.data.shape)\n            other.grad += self._unbroadcast(out.grad, other.data.shape)\n        out._backward = _backward\n        return out\n    def backward(self):\n        topo = []\n        visited = set()\n        def build(v):\n            if v not in visited:\n                visited.add(v)\n                for child in v._prev:\n                    build(child)\n                topo.append(v)\n        build(self)\n        self.grad = np.ones_like(self.data)\n        for node in reversed(topo):\n            node._backward()\n```\n\nAs you might've noticed:\n\n<ul>\n  <li>Anywhere where we used to create <em>Value</em> objects, we're now creating <em>Tensor</em> objects</li>\n  <li>Our <em>data</em> and <em>grad</em> attributes, in place of being scalars, are now Numpy arrays (which can be of practically any dimension)</li>\n  <li>In our <em>backward</em> method, we set the gradient of the final output equal to an N-dimensional Numpy array of ones instead of a scalar </li>\n  <li>We've defined a new <em>_unbroadcast</em> function that we didn't have in the <em>Value</em> class</li>\n</ul>\n\nTo understand what the <em>_unbroadcast</em> function is doing, we've first gotta understand the idea of <em>broadcasting</em> with Numpy arrays\n\n<h3>Code Break: What is is Broadcasting?</h3>\n\nImagine a scenario in which you want to add two matrices, $A$ and $B$. Let $A$ have dimensions (3, 4) and $B$ have dimensions (3, 1):\n\n$$\nA = \\begin{bmatrix}\na & b & c\\\\\nd & e & f\\\\\ng & h & i\n\\end{bmatrix}\nB = \\begin{bmatrix}\nj \\\\\nk \\\\\nl\n\\end{bmatrix}\n$$\n\nNow, based on typical matrix addition rules, <em>we know that this isn't technically possible</em> – two matrices have to be the same size in order to add their elements. However, when we try to add two 2D arrays like above in Numpy, we get the following result:\n\n$$\nA + B = \\begin{bmatrix}\na + j & b + j & c + j\\\\\nd + k & e + k & f + k\\\\\ng + l & h + l & i + l\n\\end{bmatrix}\n$$\n\nThis is due to a concept in Numpy called <strong>broadcasting</strong>, which derives its name from what is going on behind the scenes. When Numpy realizes that $A$ and $B$ are of different sizes, it \"broadcasts\" out the the smaller dimension of $B$ to match the dimensions of $A$.\n\n$$\nB_{broadcasted} = \\begin{bmatrix}\nj & j & j\\\\\nk & k & k\\\\\nl & l & l\n\\end{bmatrix}\n$$\n\nNumpy, instead of assuming you're an <em>idiot</em> that doesn't know how matrix addition works, assumes you're actually a <em>genius</em> that wants to add a row vector to every row of a matrix (or column vector to every column of a matrix), or multiply a single value across an entire tensor, and it trusts you enough to make it work automatically through broadcasting.  In a machine learning context, this comes in handy if you want to apply a \"bias\" in your neural network (which we'll see in a blog a bit later). For now though, know that broadcasting happens in Numpy anytime that you:\n\n<ol>\n  <li>You perform an elementary operation (+, \\*, etc) on 2 different sized tensors <strong>and</strong></li>\n  <li>When comparing the tensor shapes from right to left, the dimensions are equal <strong>or</strong></li>\n  <li>One of the dimensions is 1 (so it can be broadcast to match the other) <strong>or</strong></li>\n  <li>The dimension doesn’t exist (because the tensor has fewer dimensions), in which case it’s treated as if it were 1</li>\n</ol>\n\nAs an example, a tensor with dimensions (1, 1, 2) can be broadcasted to \"operate\" with a tensor with dimensions (4, 3, 2), but a tensor with dimensions (2, 2, 2) cannot.\n\n<h3>Getting Back to the Code Explanation</h3>\n\nNow that we've covered the idea of broadcasting with Numpy arrays, we can go into what the <em>_unbroadcast</em> method does in our code. You don't have to be Sherlock Holmes to deduce that <em>_unbroadcast</em> undoes the broadcasting that Numpy does intrinsically. Breaking down how it does this, after passing in a tensor (<em>grad</em> argument) and the desired shape (<em>shape</em> argument) we:\n\n<ol>\n  <li>Check if broadcasting has occured. If it didn't occur, the tensor is returned unchanged</li>\n  <li>If broadcasting did occur, if the dimensions of <em>grad</em> are greater than the dimensions of the desired tensor (the <em>shape</em> argument), we reduce down the first dimension until the passed <em>gradient</em> has the appropriate number of dimensions.</li>\n  <li>Then, we loop over each axis from last to first. If the original shape has a 1 in that axis, and the gradient has more than 1 (due to broadcasting), we sum over that axis to reduce it. </li>\n</ol>\n\nTo understand why we need this, consider the following example:\n\n```python\nimport Numpy as np\n\n# A: input matrix with shape (3, 4)\nA = np.array([[1, 2, 3, 4],\n              [5, 6, 7, 8],\n              [9,10,11,12]])\n\n# b: bias vector with shape (1, 4)\nb = np.array([[0.1, 0.2, 0.3, 0.4]])  # Will be broadcasted across rows\n\nout = A + b\n```\n\nAt this point, we have the following for \"out\":\n$$\nout = \\begin{bmatrix}\n1.1 & 2.2 & 3.3 & 4.4\\\\\n5.1 & 6.2 & 7.3 & 8.4\\\\\n9.1 & 10.2 & 11.3 & 12.4\n\\end{bmatrix}\n$$\n\nNow, if I were to initialize the gradients of out for backpropogation, we get:\n\n$$\ngrad_{out} = \\begin{bmatrix}\n1 & 1 & 1 & 1\\\\\n1 & 1 & 1 & 1\\\\\n1 & 1 & 1 & 1\n\\end{bmatrix}\n$$\n\nWe can backpropogate this gradient to $A$ without any problems since they're of the same dimension (and we only did simple addition, so the gradient \"passes through\"):\n\n$$\ngrad_{A} = \\begin{bmatrix}\n1 & 1 & 1 & 1\\\\\n1 & 1 & 1 & 1\\\\\n1 & 1 & 1 & 1\n\\end{bmatrix}\n$$\n\nHowever, things get interesting for $b$. Remember, $b$ is a vector of shape (1, 4) – if we simply backpropogate $grad_{out}$ to $b$ like we have previously done in our <em>Value</em> class (i.e. setting $b$'s gradient equal to out's gradient), we've needlessly changed the dimensionality of $b$ to (3, 4). To maintain the dimensionality of $b$ while preserving some info from the calculated gradient, we collapse the size of the first dimension (i.e. the rows of out) to 1 by summing components in that dimension together:\n\n$$\ngrad_{b} = \\begin{bmatrix}\n1+1+1 & 1+1+1 & 1+1+1 & 1+1+1\\\\\n\\end{bmatrix} = \\begin{bmatrix}\n3 & 3 & 3 & 3\\\\\n\\end{bmatrix}\n$$\n\nNow that we've covered the idea of \"unbroadcasting\", we can move on to expand our class a bit more. Most of the methods from our previous <em>Value</em> class maintain their form (outside of a few adjustments to classnames and usage of the <em>_unbroadcast</em> function), but now that we're dealing with tensors, we must also include an operation for matrix multiplication as well (i.e. the dot product):\n\n```python\n    def __matmul__(self, other):\n        out = Tensor(self.data @ other.data, (self, other), '@')\n        def _backward():\n            self.grad += self._unbroadcast(out.grad @ other.data.T, self.data.shape)\n            other.grad += self._unbroadcast(self.data.T @ out.grad, other.data.shape)\n        out._backward = _backward\n        return out\n```\n\nRecalling from linear algebra, matrix multiplication is perfomed by taking the dot product of each row of the first matrix with each column of the second matrix.:\n\n$$\n(C)_{ij} = \\sum{k=1}^{n} A_{ik} \\times B_{kj}\n$$\n$$\n\\underbrace{\n\\begin{bmatrix}\nA_{11} & \\cdots & A_{1n} \\\\\n\\vdots & \\ddots & \\vdots \\\\\nA_{m1} & \\cdots & A_{mn}\n\\end{bmatrix}\n}_{m \\times n}\n\\quad\n\\cdot\n\\quad\n\\underbrace{\n\\begin{bmatrix}\nB_{11} & \\cdots & B_{1p} \\\\\n\\vdots & \\ddots & \\vdots \\\\\nB_{n1} & \\cdots & B_{np}\n\\end{bmatrix}\n}_{n \\times p}\n=\n\\underbrace{\n\\begin{bmatrix}\nC_{11} & \\cdots & C_{1p} \\\\\n\\vdots & \\ddots & \\vdots \\\\\nC_{m1} & \\cdots & C_{mp}\n\\end{bmatrix}\n}_{m \\times p}\n$$\n\nIn other words, every element is $C$ is derived from simple addition and multiplication operations between elements in $A$ and $B$. From a derivative perspective, this means we can easily find the derivative of an element in $C$ with respect to an element in $A$ or $B$:\n\n$$\n\\frac{\\partial C_{ij}}{\\partial A_{uv}} =\n\\begin{cases}\nB_{vj}, & \\text{if } u = i \\\\\n0, & \\text{otherwise}\n\\end{cases}\n$$\n$$\n\\frac{\\partial C_{ij}}{\\partial B_{uv}} =\n\\begin{cases}\nA_{iu}, & \\text{if } v = j \\\\\n0, & \\text{otherwise}\n\\end{cases}\n$$\n\nAs a concrete example, let:\n\n$$\nA =\n\\begin{bmatrix}\na & b \\\\\nc & d\n\\end{bmatrix}, \\quad\nB =\n\\begin{bmatrix}\ne & f \\\\\ng & h\n\\end{bmatrix}\n$$\nThen:\n$$\nC = AB =\n\\begin{bmatrix}\nae + bg & af + bh \\\\\nce + dg & cf + dh\n\\end{bmatrix}\n$$\nNow, to compute a few partial derivatives:\n$$\n\\frac{\\partial C_{11}}{\\partial e} = a, \\quad\n\\frac{\\partial C_{11}}{\\partial g} = b, \\quad\n\\frac{\\partial C_{11}}{\\partial f} = 0\n$$\n\nNow, computing partial derivatives of all elements of $C$ with respect to the elements in $A$ and $B$ (i.e. the Jacobian) is a bit of strenuous task in practice. To simplify things, just know that the chain rule holds for multidimensional space as well, and the multidimensional equivalent of multiplication is matrix multiplication. Consider a function, $L(C)$ which takes in a matrix and spits out a scalar. From that, we have the following definition of the chain rule:\n\n$$\n\\frac{\\partial L}{\\partial A} = \\frac{\\partial L}{\\partial C} B^T\n$$\n$$\n\\frac{\\partial L}{\\partial B} = A^T \\frac{\\partial L}{\\partial C}\n$$\n\nWhich matches with the <em>**matmul**</em> definition that we declared above. After migrating the other functions from the <em>Value</em> class, we end up with something like <a href=\"https://gist.github.com/JackTNorris/6b09d33fc551c7b33966b2fc6951a42c\">this</a>.\n\nAnd that's it! We can go ahead and test our <em>Tensor</em> class with the following and verify that our backward pass works with multidimensional function inputs. We're ready to build our own neural network from scratch!:\n\n```python\n\"\"\"Testing our Tensor class\"\"\"\n# Inputs\nx = Tensor([[1.0, 2.0, 3.0]])       # shape (1, 3)\nw = Tensor([[0.1, 0.2],             # shape (3, 2)\n            [0.3, 0.4],\n            [0.5, 0.6]])\nb = Tensor([[0.1, 0.2]])            # shape (1, 2)\n\n# Forward pass: x @ w + b\nout = x @ w + b  # shape (1, 2)\nprint(\"Forward output:\", out.data)\n\n# Backward pass\nout.backward()   \n\n# Print gradients\nprint(\"\\nx.grad:\\n\", x.grad)\nprint(\"w.grad:\\n\", w.grad)\nprint(\"b.grad:\\n\", b.grad)\n\n# Expected:\n# - out = [[2.3, 3]]\n# - ∂out/∂x = [[0.3, 0.7, 1.1]]\n# - ∂out/∂w = [[1, 1], [2, 2], [3, 3]]\n# - ∂out/∂b = [1, 1]\n```","createdOn":1754544626992,"lastEdited":1754660296085,"tag":"🧮 math","title":"Multidimensional Automatic Differentiation in Python"},"-O_N8K6VcGcw2hGqgTvd":{"content":"<em>note: The content of this website is mine alone and does not reflect the views of the U.S. Government, the Peace Corps, or the Paraguayan Government.</em>\n\nI know I said I'd write a bit more frequently in my last blog, but I did a bit of mental math and realized that one blog every two months roughly equates to 13 blogs by the end of my service... I'm not trying to write an epic here (I'll leave that to Homer), so I figured I can just stick to the writing schedule of \"when the mood strikes\" and leave it at that.\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://media1.tenor.com/m/rmE-jqbgUhAAAAAd/calculate-add.gif\" />\n\n  <figcaption align=\"center\"><em>Calculating how many blogs I'd have to write</em> </figcaption>\n</p>\n\nAnyways, now for the recap of how service is going. For starters, after a few weeks of helping out at the Peace Corps Training Center, Grace and I hosted \"Long Field Practice\" (LFP) for the new cohort of health volunteers. In short, we hosted a group of trainees in our community and showed them the ropes of life as a health volunteer in rural Paraguay -- we did some charlas, watched some cows, cooked with  some host families, ran a kids' club, and even had some time to squeeze in some squats. It was a real treat to see our community members interact with a fresh set of Americans, and I think we did a pretty awesome job matching trainees to host familes. The biggest takeway from the experience though? While the C7 cohort will always be #1 in my eyes, it's clear C9 is full of some pretty awesome folks as well.\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczNiJyMd0jf-4-APIXkXX_YzdRa0lcNuQiyUbMXvw4LIxmJsv8CSOFBpXpF_z9ux4GavZRnnc3Ft47O_Gl3eKLhiE1IxJsaKO80roXGUztT7CzVOVI78irRooxzysa-YkZnjLLn5PyMppwga7zz2fYjbzQ=w2752-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>Making alfajores and kavure with C9</em> </figcaption>\n</p>\n\nShortly after LFP, Grace and I packed our bags and hopped on a flight to Chile with her family. In total, we ended up spending a week in-country, splitting our time equally between Santiago (the capital) and Valparaiso (an artsy-fartsy city on the coast). Our days were filled with hikes, seafood (Bote Salvavida is AWESOME), coffee, and bouldering routes, with some sprinkles of Pablo Neruda poetry here and there for good measure. While it was refreshing to experience Chilean culture in all its glory, the mountains are what really stole the show -- Tres Kandu is cool in its own right, but it has nothing on the staggering brilliance of  <em>real</em> mountains like the Andes. I had almost forgotten how much I missed mountains (and now, mints)!\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczMLPIS9VCK3EfR-gJ0XT8rYj-dx5-LhT-ESCNeNj50Oi3xRKFwZvd8ifffsyWtNMLDp0jaOsseOKKtg7BZVrijKN48_bvwQtK9e_rh_wx2xMtRIuhdRdrf2xpTL6ONEAiQcLfUVbrpmi3NWkTy9E9xJkQ=w2752-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>A photo at an undisclosed location</em> </figcaption>\n</p>\n\n<p align=\"center\">\n  <img height=\"250\" width=\"250\" src=\"https://lh3.googleusercontent.com/pw/AP1GczPyET1cnVBswWVHRNghvWGGeA-Z3mx9zhQD1E9IXEPeBE5Rgx7uMJ1eYl3SrKfNd-oHJyhujZNb9SO8CLqxmx-FwjTBKrpbVr_tJXh5gy-dl9Lwg9psv5lMfjOJ8apdi4J0TnS_g3mzGSbewliMdE7m9Q=w1549-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>20 Bouldering Routes of Blisters and Despair</em> </figcaption>\n</p>\n\nWhen we got back to site, Grace and I jumped right into leading a winter break kids camp. Sessions consisted of a small dose of health-related programming, followed by some new games and activites as a reward for our attentive audience. One particular game we taught was quite popular: baseball! Some of these kids can really smack that ball, so it's a shame that Paraguay doesn't have a national baseball team. It's also a shame I quit little league -- not to brag, but I was hitting some dingers out there myself.\n\n<p align=\"center\">\n  <img height=\"250\" width=\"250\" src=\"https://lh3.googleusercontent.com/pw/AP1GczPVxvu7JZux-ElDGvC5-iMlyp3ybMPP5Ps4l7pB9aUTjqoL2CNBzXV5HLNFXdxc2mBGcPPC7bSRWQPCPsDN-04WV80dncFkZeMrpRUvm5CKPkjsUcAHjDlfZ_EozTMRh7oEMCiGvbCdf4EBIDDBK60iVg=w1549-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>Cool pitcher from the photo album</em> </figcaption>\n</p>\n\nAs far as other activities go, Grace and I have been running fitness classes using our homemade gym equipment. With our bench now complete, we can do practially any exercise imaginable. While Grace runs a more diverse women's fitness club (Zumba, running / walking, calisthenics), I've been mainly focusing on weightlifting with the guys. While consistency is a struggle for some community members, others are some of the most dedicated individuals I've ever met! One of our regulars is a single mom in the community, who comes practically every weekday to get in a pump and teach some of her friends various exercises. At this point, we've left a key and a barbell with her so she can use the equipment whenever she wants!\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczPkZW-ikmcr7r_bK4zKv8Zsq2u4Yvhmbrq0BlrtCfNKz0j50D-T_im9Ocj_9MrdCSXZEapX-5alq5cCjpTOFMLKbzvWEm1Ax4y8tubD80DFawmxgR73dXQCE3Am02vLP7gPYJz9p0Wd11kaEuR8kRFQ7Q=w2752-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>Pumping concrete</em> </figcaption>\n</p>\n\n<p align=\"center\">\n  <img height=\"250\" width=\"250\" src=\"https://lh3.googleusercontent.com/pw/AP1GczOHUALHLeAMFlqSvchh6P9MDB62G7WZuzBdVDgs_rSBZnBioMnfmk-ZHGq9tWJVsXtH6Vbhr0fXPlA9amBLY45lGCeTim1o7jgbaDc3TqdfuVbQYR1i7U9Lh9O-fCADNtIixhICj2uQRX08Twj9WnfDSA=w1549-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>Pumping concrete pt 2</em> </figcaption>\n</p>\n\nOn the more intellectual side of things, Grace and I have also been running a chess club at the <em>escuela</em> and a computer class at the <em>colegio</em>. An RCPV that's currently living in Paraguay was kind enough to donate some boards to my community, and I'm happy to say we've been getting a ton of use out of them. We've been awarding certificates to the kids that demonstrate competency in the basics of chess, and the plan is to run a small-scale tournament once enough people know how to play. The computer class has been going equally as well -- we're teaching students how to type and use the Google Cloud suite. The donated computers from Labdoo have been working like a charm!\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczPEZ6eq3ZQWsPNRNfvtZICRYyIDP4EyTHKZN1Yplhu8QHib1xfxrqdpLdhJk30XmkTixeHIHip3ECCaCpvu4dp42STbnVYyxrhphduTIVjy7EeDxWCP9qA7_z4bNSPJKQ3yReXlu7b8ctzEDIqSdrr6Vw=w1600-h1200-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>Big moves, big chess board</em> </figcaption>\n</p>\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczMowQKeOd5nkrIelACA6cN7byCJTf8LfmUTU4gDHH6g4HVEJWH71y0i2CMBwT31FaFuqyp4Tgw9FcZFCJiSYEOwzvptFSAixVVgFFXlLqcdu79gVQ7rjfbN2WGkyeQLEHak3udMUW45INIo7scfHS6Slw=w2752-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>Computers!</em> </figcaption>\n</p>\n\nThroughout all of this, I was training for a marathon! Why? I had never run more than 5 miles in my life, and I wanted to challenge myself. I'm also a sucker for a good story to tell the future grandkids (I really liked the ring of \"I broke my foot in South America... then ran a marathon\"). It took about 18 weeks to train for the race, and I'm happy to say that I (and my buddies who also ran) completed it! My time wasn't anything to write home about, but I happily crossed the finish line relatively unscathed -- no shin splits, no dehydration, and no blisters. As an added bonus, I picked up a free Coke en route to a photo finish!\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczNPlgaphlfUTEPs5kDP5S9eutppIBj_aWNZlV65QNT7PGFfBjmCuhGWFHWMhxJACnw8GHL1Fdtxk2cBL8WvBZR9gUfFbD8PrYofrF_3rqJpg_D_fXsEcY4WoKJN5VnAw60OweN2TMw5CStQxXf6jCEZew=w2560-h1706-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>\"I don't stop when I'm tired, I stop when I have a Coke\"</em> </figcaption>\n</p>\n\n<p align=\"center\">\n  <img height=\"250\" width=\"250\" src=\"https://lh3.googleusercontent.com/pw/AP1GczMdKema9dcuvTAEwd25BTiKVneMOn-BDNQyL9_ATFqkmgPhKgu1Gmz7gSrOKHm-Mkiak5Pyxvh0wt_hyySfbFiT073OSF4ng8Kn7CU5vwRd9kWCuFKWtwvMdFm1bw-_x2lFAtXqaikgqs-JLYZAJdWXEQ=w1200-h1600-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>\"Never doing this again...run it back next year?\"</em> </figcaption>\n</p>\n\nLast thing: a week or so back I finally made it out to a Paraguayan national fútbol game! It was against Ecuador to see who would play in the World Cup in the U.S, so it was pretty high stakes to say the least. While the game finished at a somewhat uneventful 0-0, the atmosphere in the stadium (and the proceeding block party) was exhilirating. The best part though? With the way some other FIFA matches shook out that night, Paraguay qualified for the World Cup! <em>Jajotopata los estados unidospe</em>!\n\n<p align=\"center\">\n  <img height=\"250\" width=\"250\" src=\"https://lh3.googleusercontent.com/pw/AP1GczMM3UCHn9vAJHe_KIEvRSHDJ4Ov1SkvF2CkTPoktReU78KPfGMALxKc1cvizd8xMPXjc4N4BhnOWrr7G-HeuPFH8KyE-uWsq0FndxTehJyQPy39TDN4K4lhec5Yi_CWr7Od6cBrsg-vGBJiyVnghvTjMA=w1549-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>Father-son bonding time</em> </figcaption>\n</p>\n\nIt's hard to believe that we've got less than a year left in service. RCPVs say the first year goes by pretty slow (and the second goes by quick), but it hasn't really felt that way for me; I already feel like things have been going at hyperspeed. I guess that just means this next year will pass at...ludicrous speed? With graduate school application season practically upon us, I sure hope not -- I write pretty slowly. Regardless, I'm looking forward to this next year; I've got a lead on some folks that might be able to source a library for my community, I'll be continuing some part-time research at UNA, and I've got a pretty solid group of guys that come to my fitness classes. Moving forward, I'm hoping to grow my fitness classes to encompass a larger age range, flesh out the gym with some new equipment, and possibly start a science club with some of the younger kids! I also recently got a guitar, so hopefully I can completely shred some John Mayer by the end of service.\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://i.makeagif.com/media/2-09-2023/jcvsPP.gif\" />\n\n  <figcaption align=\"center\"><em>Second year of service be like</em> </figcaption>\n</p>\n\nAs per usual, here's a few bonus photos and a sporadic list of things I want to remember: hostel hair havoc, beached seal, street seal?, pig birth, following Jesus, amphibian strat, bonkers alarms, meeting Ricardo (lab), zima blueeeeeeee, ligament leave, partidí juntos, first time paddler, profe empanadas, platonic pool, random robotic dog, Uno café sala, Alberto tortillas, shoe swap MST, and chess seshes with J.C.\n\n<p align=\"center\">\n  <img height=\"400\" width=\"400\" src=\"https://lh3.googleusercontent.com/pw/AP1GczMRAWB6xSnLgEGbsawQD4j03vOY8hEurIb2ngRCBeWrKWxe5gARkBsytCJZkwwZUFhDor7u3g72OPRSO5eqnRrtEedK7ttWs6fM5uP5cFuzdGZomX51WxRqqoLvZrM6z3rG_XuQbOZNPWAIOiLZ9NjYCg=w3264-h1472-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>Host bro-in-law fishing excursion (ft. not a single fish)</em> </figcaption>\n</p>\n\n<p align=\"center\">\n  <img height=\"250\" width=\"250\" src=\"https://lh3.googleusercontent.com/pw/AP1GczP7p-uaA8tVBVxj0k_C44NivErpZvZ1IclfWDdYuSDKSs8ay-PLQH3HBYRKdctRsq2Dl3DjxwuaNDaNxh7aibUc2S65bG_ALBd7NV0E1kAeP5At1nc-4kfdsPjFr-fRSR8hwCgraSWPJf5SgQyWb_z1lw=w1549-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>Gym QA testing with some PCV bros</em> </figcaption>\n</p>\n\n<p align=\"center\">\n  <img height=\"250\" width=\"250\" src=\"https://lh3.googleusercontent.com/pw/AP1GczOdBcNs1Q26oQFWPv2seZttz7q9Hs7lPyYroJtxhOifEpEHOZri6jZljHl3BLDAsHnGOoY4ILsHNLbRyXVaudJK6jcJP2VHFdMBsSbWeqHdOayhgipdg5p9SHXMu1uxhcjoFyzObUKyxc34-Q_io1tjAQ=w1549-h2064-s-no-gm?authuser=0\" />\n\n  <figcaption align=\"center\"><em>Dinner with Alberto</em> </figcaption>\n</p>","createdOn":1758120464719,"lastEdited":1765037108954,"tag":"🕊️ peace corps","title":"The Marathon Arc (ft. Chilling in Chile, Hitting Dingers, and Pumping Concrete)"},"-OftjdxBBOfseExwmjV4":{"content":"<em>note: The content of this website is mine alone and does not reflect the views of the U.S. Government, the Peace Corps, or the Paraguayan Government.</em>\n\nI just wrapped up some grad school applications, and my brain is pretty fried from all the formal writing. Naturally, that means there's no better time to update my blog and spew out some words that I don't have to proofread as careflly. It's already December, and I want to get a few updates out before things get hectic with some backpacking, a visit home, and summer activities. I haven't done anything quite as exciting as running a marathon as of late, but I've got a few things to document nonetheless.\n\nShortly after the last blog ended, Grace and I had the opportunity to meet members of Congress that were making the rounds through South America. They stopped at the U.S. Embassy in Paraguay and wanted to meet some current PCVs! The embassy set up a pretty chuchi luncheon, and every Representative was seated alongside 2 or more volunteers. I ended up sitting with Representative Claudia Tenny. It was my first experience meeting a Congressperson, so needless to say, it was pretty neat.\n\n<p align=\"center\">\n  <img height=\"400\" width=\"400\" src=\"https://lh3.googleusercontent.com/pw/AP1GczNEJg_Bu_fMf0rE_rw-PsbAK2oKBOsBncdo83BFwhm8KQoPuTbIaW9ZlQuB07i1Fehz0HBTW29dXGLiIXCYE0gWBtmuf63o6zyMudiE8vGy2plrWaQXb05MhLWrPQfq2dmXQK9NT0_M23MwAdq_Aw6UxA=w2660-h1995-s-no-gm?authuser=0\" />\n  <figcaption align=\"center\"><em>\"We the People\" eating asado</em> </figcaption>\n</p>\n\n\nBack in site, keeping up with community integration, I invited my buddy Alberto over for some good ol' fashioned American fried chicken. He kept his cool when he tried it, but I'm pretty sure I completely blew his mind with the flavorful awesomeness of my cooking (source: before and after pictures of fried chicken dinner). Not wanting to be outdone, Alberto came over with his buddy Lisandro a few weeks later and we had ourselves a delicious asado with Paraguayan fried chicken. Perhaps I'm biased, but I preferred the former (though both variations were quite delicious).\n\n<p align=\"center\">\n  <img height=\"400\" width=\"400\" src=\"https://lh3.googleusercontent.com/pw/AP1GczON2mwz8kqwUPPVCKKqJroIj1f0ogLq333dGMKbd60tZuF5j35kIfDP1euCd2vll7aDvDwNtcmFLg3XpptWp0XGP69zkORcZmPZPeKGJGhoAFWgHT7p5ihrwECZuF-_x8GpqEgeXgCJtYwa-R-1g80L0A=w2660-h1995-s-no-gm?authuser=0\" />\n  <figcaption align=\"center\"><em>Exhibit A: Before fried chicken</em> </figcaption>\n</p>\n<p align=\"center\">\n  <img height=\"400\" width=\"400\" src=\"https://lh3.googleusercontent.com/pw/AP1GczPxfq4ft9_sP4FU4nWKrGBjkH_h07aXwgodMAT5zyopiqWjfVYFxzLKT_pIvCqmY5FMHyAK0TnZO_oOFwz-jbZklrl51zUtKCWKjnbLorj84DpXq730AtQEuYQjcQvF0x4hv_XDo_hD8SoXnHmo6d4WiQ=w2660-h1995-s-no-gm?authuser=0\" />\n  <figcaption align=\"center\"><em>Exhibit B: After fried chicken</em> </figcaption>\n</p>\n<p align=\"center\">\n  <img height=\"400\" width=\"400\" src=\"https://lh3.googleusercontent.com/pw/AP1GczM6Serl_WJeFbgN_80gYaTztoGXDHTgFqwVvQaSNkPMfzQlwRt6ZDelhhxk0GYI1jEP4QE1hWMJXyx3y9N1zO1tW-twCcBFiHlrjmfDYQWzCcf3xfFvpnYAbKZZa28C78heJbJoANskx2S5_JJsJ9o5Nw=w2660-h1995-s-no-gm?authuser=0\" />\n  <figcaption align=\"center\"><em>The Chicken Strikes Back</em> </figcaption>\n</p>\n\nWork-wise, Grace and I have had our hands full with chess club, computer classes, and fitness classes. Chess club has been slow going, but around 5 kids already know how to play chess quite well! We're hoping to train a few more over the summer so we can get a mini-tournament going in our community. The fitness class has also been pretty successful. It's sometimes a struggle to get kids to do exercises with good form, but we're getting there! Getting the kids to show up to the club and get moving is already half the battle.\n\n<p align=\"center\">\n  <img height=\"400\" width=\"400\" src=\"https://lh3.googleusercontent.com/pw/AP1GczMJ6hHEF7yhW-GDkAxtIoi80p3caXDfQrcg2VHHXTpAHMlOswS3mZICP9bserPYPWrLB5U-MnEZBHuIaZkCaQd7cVS7m10ievZV5ZWzVjJ69DeRHLsFRrfGqLn-4Q_ELKSNhrPKUGYoXEul4gWJlbIudg=w2660-h1995-s-no-gm?authuser=0\" />\n  <figcaption align=\"center\"><em>Stretching the class</em> </figcaption>\n</p>\n\nBy popular demand, we started up a digital literacy class for middle schoolers in addition to high schoolers. The kids are a bit more rowdy, but it's remarkable how fast they pick things up! While we focus on basic computer skills (typing, using the mouse, opening files, navigating the web, e.t.c.), we've also had the time to teach kids the basics of Google Docs, Slides, and Sheets. We have kids working shoulder to shoulder as they share laptops for now, but we should be getting a new shipment of devices from Labdoo by the start of the new year!\n\n<p align=\"center\">\n  <img height=\"400\" width=\"400\" src=\"https://lh3.googleusercontent.com/pw/AP1GczMAUZ1icU48c-nbM5F1yFVgsEjtlXtIrYmBzC3EPe5UQOTgBAb9X-48wJtdabemQEfTlAS-aBSvgqjXCq-LYUmi9liTw036jVaVWl50FhGxFGkIzACsTM9nPfhBGCEZrIjdqN8XV8eIeqVuTcR6YJ_rZw=w2660-h1995-s-no-gm?authuser=0\" />\n  <figcaption align=\"center\"><em>Classroom overflow</em> </figcaption>\n</p>\n\nOutside of work, Grace and I have been able to spend a few weekends hanging out with some volunteers. We also finally got the chance to hike up <em>Tres Kandu</em>, and I can confidently proclaim it is indeed a mountain. Or at least, it definitely felt like one when we were trying to summit it! I've been on a lot of hikes in my life, and that was for sure one of the most strenuous. We also joined a bunch of volunteers in Asunción to run in a breast cancer awareness 5K. Both Grace and I ran the whole time without walking, which is more than I can say for my marathon!\n\n\n<p align=\"center\">\n  <img height=\"400\" width=\"400\" src=\"https://lh3.googleusercontent.com/pw/AP1GczO9wASjdgEDiAPjIKeFGFEKdULkog0odQtksBYqBG3wCpo7Yc9ijdGf3oRRgurcriW5_NrlokFQ6JO8xrA_CpJ6Cx5VMjdTTIly9m8loLPwrpz5GPRQnoC-Zn_ZT4Gp0jzAjrukQzpZd6LA-glexfyxgA=w2660-h1995-s-no-gm?authuser=0\" />\n  <figcaption align=\"center\"><em>First 5K: COMPLETED</em> </figcaption>\n</p>\n<p align=\"center\">\n  <img height=\"400\" width=\"400\" src=\"https://lh3.googleusercontent.com/pw/AP1GczO5caQvSoOz6j0u7U2ZQ96yRrQOnUjF_hfrfcYDGthYT--4NZ2xjb0Sl6o96sJuyWpWDwxtcik6EYZK9FhIJ1hbsgdsGYXdV0DipBub7aZ9RyPNyqgArmHw6rkSFo9bDKf30dor9Esh6IsqENvBNza8Mw=w2660-h1995-s-no-gm?authuser=0\" />\n  <figcaption align=\"center\"><em>\"I can't see crap\" -- us at the top of Tres Kandu</em> </figcaption>\n</p>\n\n\nI briefly alluded to this in my past blog, but outside of Peace Corps work, I've been making bi-weekly trips to Asunción on a night bus to participate in some research meetings with a professor at the national university, Dr. Diego Galeano. He works at the intersection of AI/ML and drug discovery, so it has been fascinating to work under him and receive guidance. I typically try to take a bus to the capital and back on the same day to limit my time away from site, but on the days I can't, I crash at a friends place for some chess, futsal, and (occasionally) good asado. This most recent meeting, I had the pleasure of meeting Dr. Galeano's PhD advisor and grabbing lunch with him and other lab members.\n\n<p align=\"center\">\n  <img height=\"400\" width=\"400\" src=\"https://lh3.googleusercontent.com/pw/AP1GczMDxe04XJEQ-5ENxAeAvpR0oWPRz83bqO4droHoGKaPInHOUbDwE5jnNa5dlog9P4Wzhu1F6PKnfFKO37nMb25NW6Twb_21QRgwiSASPXt38b9ssla9Zo6C3n5MQ0B-lbHyYtVCPdn9Z8zsMbsaDkBgEA=w1280-h960-s-no-gm?authuser=0\" />\n  <figcaption align=\"center\"><em>Grabbing lunch (after falling out of a chair)</em> </figcaption>\n</p>\n\n\n<p align=\"center\">\n  <img height=\"400\" width=\"400\" src=\"https://lh3.googleusercontent.com/pw/AP1GczOlasv0Mggmmgz8o3NmjqhEjPyV73Ywpn_Za8HsdWMv3A5DLWxLMlGFCaKQWXACVDEqxr0iupjTY9SWc8l3AEvXvbcJuY-rppFe7C3g61H1EVVuAzHAjOFpEhJ_7CA2_Zhw9Cvdz4kajYvX-ZV88pzK3Q=w2660-h1995-s-no-gm?authuser=0\" />\n  <figcaption align=\"center\"><em>\"This is the best asado...I ever had\"</em> </figcaption>\n</p>\n\nWith summer already upon us, things have slowed down significantly. All the kids are out of school, a sleu of holidays is on the way, and Grace and I recently put a pause on our activities while locals (including us) take some time to relax and spend time with family. After the full-out sprint that has been grad applications, it's been quite nice to have some downtime (and shred on guitar). I'm enjoying it while I can, since I think we'll have our work cut out for us post new year's with health clubs, computer classes, and a new library initiative we've been trying to start! \n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczP6qzd-8JbxCkOnIUrEG07Di3DfsAXM8jQpY3M3eqPfNVOqrdk-1yO-aNa4oaz_1CLPC27jARZgveAgDLJrundRKiWjkHAkTnSrBUPOdRwpR6KY0DZgAKdM47efxUd43b0T1ANPQfySkbNiHeeJ4PzUZg=w480-h640-s-no-gm?authuser=0\" />\n  <figcaption align=\"center\"><em>Donated books on the way to Paraguay!!!</em> </figcaption>\n</p>\n\nAnyways, Grace and I will be backpacking in the Patagonias with my brother in a few days, and we'll be spending Christmas back home with some family. Hard to believe it's been a year and a half since I've seen my siblings, so I'm pretty stoked to be home for a bit. All this travel means that I'd better get packing, so signing off, here's that sporadic list and pretty awesome bonus photos: licor festival, one armed man and cat, ovalema violin and asado, cat visits, measuring office, true wildness and carrotcake, dodgers dub, homie asado, octubre rosa 5k, \"tocho bien?\", bare grass, car on fire, paint and nails, raffles.\n\n\n<p align=\"center\">\n  <img height=\"300\" width=\"300\" src=\"https://lh3.googleusercontent.com/pw/AP1GczN9VdFsHNTkmrqGjo-GLSbVGiA9KPZV4VAaQPu_x897oO_12dHNhQlRo0mK0JMCf9Z8W5WDicn90q0SLI7BoYjxpktUR4PVSOym7qvvdpm5KoNlj9aN5R5pAu0DElJEZ439IgjhkXkCS-To7xLUqV0kxg=w1496-h1995-s-no-gm?authuser=0\" />\n  <figcaption align=\"center\"><em>3 thinking bros, 2026 A.D.</em> </figcaption>\n</p>\n\n","createdOn":1765126610518,"lastEdited":1765126610518,"tag":"🕊️ peace corps","title":"Congress, Climbing Mountains, and Classroom Overflows"}}